{"https://www.huffingtonpost.co.uk/entry/omicron-variant-covid-symptoms-vaccine-booster_uk_61a7a1cbe4b07fe201216f51": "But so much remains unknown about the new variant. Here’s what we’ve learnt so far. Omicron is a Covid “variant of concern” which was first flagged by South African specialists and then named by the World Health Organisation (WHO). It’s not yet known how deadly this particular strain is compared to previous ones such as Alpha and Delta. By Friday, 42 cases of Omicron had been found in the UK. People who test positive for Omicron have displayed the following symptoms: Extreme tiredness Mild muscle aches Fever Night sweats Scratchy throat Dry cough Unlike with the Delta strain, patients have not yet reported a loss of small or taste. There has not been a reported drop in oxygen levels among infected individuals either. Last Sunday, the WHO said: “There is currently no information to suggest that symptoms associated with Omicron are different from those from other variants.” The symptoms reported so far have ranged from mild to severe disease, according to the WHO, making it hard to define how dangerous Omicron really is. Dr Maria von Kerkhove from WHO believes Omicron may be more transmissible than previous variants, based on the rising number of cases in South Africa where this new strain was first detected. However, she said there was still a question mark over whether it was more transmissible than the world’s current dominant strain, Delta. Dr @mvankerkhove updates on what we know so far about the new #COVID19 variant of concern, Omicron ⬇️ pic.twitter.com/43jqMUotrX Scientists are yet to find out just how effective any of the vaccines are against this new strain, as they were all developed against the Delta variant. While specialists behind the Oxford-AstraZeneca and the Pfizer-BioNTech jabs suggest the vaccines will still be able to keep severe disease away, Moderna’s CEO Stephane Bancel disagreed. He pointed out that most of the mutations in the Omicron variant occurred on the spike protein, which is used by the Covid vaccines to boost the immune system. He told the Financial Times this meant there would be “material drop” in the effectiveness of the jab. He said: “There is no world, I think, where [the vaccines’ effectiveness] is the same level we had with Delta.” However, the UK has already announced that all adults aged 18 and over will be able to get their third jab soon. Although the exact effectiveness of the current vaccines against Omicron remains unknown, some experts claim the shots should still prevent hospitalisation and death – even if it does not stop infection. Britain has now ordered an extra 114 million Covid boosters so that other booster jab campaigns can be unrolled at short notice if another “variant of concern” makes its way to the UK. The WHO says the health risk from Omicron is “very high”. It has made it clear that more data is needed before it can confirm the transmissibility of the variant, the severity of the disease and just how it responds to the vaccines. The WHO has also blamed richer nations for not distributing vaccines around the world for the emergence of the new variant. The organisation said scientists should know more about the variant “within days, not weeks”. Downing Street called a press conference on the day that WHO identified the variant and announced “temporary and precautionary” rules were being brought in to get ahead of this new strain. This means masks are now mandatory in shops and on public transport. International travel rules have changed too, with more southern African countries added to the red list. People arriving into the UK need to take a PCR test on the second day of their return. The rules will be reviewed after three weeks, shortly before Christmas. Health secretary Sajid Javid has emphasised that if Omicron is no more deadly than Delta, the restrictions will be lifted. Prime minister Boris Johnson has encouraged the public to continue socialising and to carry on with their Christmas plans. The government has also refused to implement plan B, which would see vaccine passports for some venues, and has suggested that another lockdown is unlikely in 2021. Senior Trends Reporter, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/omicron-variant-covid-dangerous-symptoms_uk_61a8b54be4b07fe201239188": "The World Health Organisation (WHO) has confirmed that it still needs more data to truly understand how transmissible this strain of the virus is, how severe its symptoms can be and how effective the vaccines will be against it. Although it is still too early to have a clear picture, early research appears to have provided experts with a little insight into how the kind of impact the new variant might have on the pandemic. There are concerns that the new variant could be more transmissible than the Delta variant, which is currently the dominant strain around the world. Dr Maria von Kerkhove from WHO said there is an early suggestion that it can be passed from person to person more easily compared to other Covid strains. She added: “It is certainly possible that the virus, as it continues to evolve, may still have a fitness advantage, meaning that it could become more transmissible. More transmissible than Delta? We’ll have to see.” There has been a sustained increase in cases in Gauteng, the South African province where Omicron was first identified. This increase in cases is much steeper than seen when Delta first took over the country, which suggests the strain is more transmissible. However, not everyone agrees. South African professor Anne von Gottberg from the National institute for Communicable Disease told WHO that Omicron does not seem to be any more contagious than Delta. She instead believes that “the susceptibility of the population is greater”, as previous Covid antibodies don’t seem to protect people from this strain. It’s worth noting only 24.6% of people in South Africa are fully vaccinated. Dr @mvankerkhove updates on what we know so far about the new #COVID19 variant of concern, Omicron ⬇️ pic.twitter.com/43jqMUotrX Omicron is believed to trigger extreme fatigue, body aches and headaches but not the loss of taste or smell and no drop in oxygen levels as seen in previous variants. Others have flagged dry coughs, fever and night sweats as other potential symptoms of the new variant, too. WHO’s Dr von Kerkhove said: “We have seen reports of cases with Omicron that go from mild disease all the way to severe disease. “There is some indication that some of the patients are presenting mild disease, but again, it’s early days.” ““There is some indication that some of the patients are presenting mild disease, but again, it’s early days.”” She noted that there has been an increase in hospitalisations across South Africa, but this might be due to the high number of cases in the country rather than Omicron. However, UK scientists from the New and Emerging Respiratory Virus Threats Advisory Group (NERVTAG) have warned that Omicron could trigger a surge in Covid infections which is larger than previous waves seen in Britain. They believe Omicron “might have very serious consequences” in the UK and could overwhelm the NHS. The vaccines used around the world were all built to protect against the Delta variant strain of Covid which was first reported in December 2020. WHO noted that the new variant appears to have mutations on the protein spike used to infect people, meaning Omicron could evade the body’s immune response even when it has been boosted by the vaccine. WHO’s emergency director Dr Mike Ryan also warned that there is no evidence booster jabs will help protect the population against Omicron. In a push for vaccine equity, he said: “The real risk of severe disease, hospitalisation and death lies in particularly at-risk and vulnerable individuals who do require protection against all variants of Covid-19.” There are concerns that the antibodies from previous Covid infections may also not provide resistance to the new strain. Moderna’s CEO Stephane Bancel has also claimed that the current vaccines are unlikely to be effective against Omicron – although people who helped created the Oxford-AstraZeneca jab and the Pfizer-BioNTech vaccine have claimed their shots will still be effective to an extent. Professor von Gottberg made an important distinction when she said that while antibodies from previous infections may not stop people from contracting the new virus strain, it might be enough to prevent hospitalisation and death. The WHO has emphasised that for now, people should continue to use the measures which curbed Delta infections for Omicron. to prevent infection altogether. The government has introduced three weeks of “temporary and precautionary measures” in England to buy the scientists some time to research Omicron. The WHO has also promised more data around the new strain will be unveiled in the coming “days, not weeks”. Senior Trends Reporter, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/bbc-one-christmas-idents_uk_61a76e3fe4b025be1af1254c": "This year’s offering features characters from the beloved Aardman Animation series Shaun The Sheep, whose festive special is at the heart of BBC One’s schedule this Christmas Day.  As much as we love it (and we really do), it got us thinking about the iconic idents of BBC Christmas past, so prepare to revisit festive seasons past with 10 of the best there’s been... Around the turn of the millennium, the red and orange balloon was BBC One’s trademark identity, and it would be seen in various locations in idents used between 1997 and 2002.  In 2000, Santa was left in charge of piloting the balloon in a specially commissioned Christmas ident, using it instead of his sleigh to deliver presents.  In 2015, the BBC told the story of Sprout Boy, who – as an unloved vegetable – went in search of people to love him, only to stumble upon an all-star gathering of BBC celebs where he was welcomed with open arms.  The short GCI story was narrated by the then-Doctor Peter Capaldi, and saw the likes of Claudia Winkleman, Idris Elba, June Brown, Mary Berry and Benedict Cumberbatch reimagined as animated characters.  OK, so the actual 1993 ident in itself was pretty boring – it just featured an icy figure ‘1’ is in a snowy landscape, with two polar bears and Santa flying above it.  However, that year also saw perhaps the BBC’s campest-ever festive marketing campaign, which featured a host of the channel’s biggest stars at the time including Linda Robson, Pauline Quirke, Bruce Forsyth and Mr Blobby singing along to a specially composed song to showcase all the shows on that year.  Altogether now, “Ding-dang, ding-dong, shing-a-ling-a-ding-dong!” The BBC caught Happy Feet fever in 2007 when they introduced us to their own penguins who skated around a Romford ice rink for their Christmas ident.  It actually proved to be so popular that the BBC later repurposed the ident for use outside of the festive season by removing the Christmas tree, airing it during the winter period up until 2016.  The BBC have a long-standing relationship with Aardman Animations, with the Wallace And Gromit creators making a number of idents over the years – not least 2021’s offering.  Their earliest one came in 2001, when three toys took centre stage in the Christmas ads that were all connected to the festive schedule.  They included a dog to represent the network premiere of Toy Story, a dinosaur to showcase that year’s flagship drama The Lost World, and a Reliant Robin van to signal the comeback of Only Fools and Horses, while the BBC balloon could also be seen through the window.  The BBC commissioned a special festive film in 2017, from which that year’s idents were taken from.  The Supporting Act told the story of a schoolgirl attempting to capture her father’s attention by practicing a dance routine for an upcoming school talent show and was set to that year’s huge chart hit Symphony by Clean Bandit and Zara Larsson. After BBC One did away with the balloon, they had scope to create something completely different for their festive idents in 2002.  The end result was this cute little clip, which saw young children running around a winter landscape dressed as adorable snowflakes.  For the first time in BBC One’s history, the ident was reused the following year, which prompted a wave of complaints.  Following the outrage over the reuse of the Snowflake idents in 2003, the BBC came out swinging (or should that be bouncing?) the next year with one of their most memorable efforts ever, which was actually designed by a Blue Peter competition winner.  It saw a group of children dressed in red and bouncing on Space Hoppers that looked like Christmas puddings and featured a festive remix of what was the BBC One theme music at the time.  Ten years ago, the BBC did a fresh take on their 1993 sing-along when their idents featured a host of celebrities belting out Consider Yourself (from the musical, Oliver) at a Christmas party, before all coming together in a snowy landscape with carol singers and sledgers gathering round them. Among the stars were Bruce Forsyth, Tess Daly, Graham Norton, Matt Smith, the kids from Outnumbered, Alex Jones, Lenny Henry, Anne Robinson and June Brown, which was quite the eclectic line-up.  Doctor Who was at the peak of its popularity in 2009, and after it was announced David Tennant would be vacating the Tardis to make way for Matt Smith, the BBC decided to mark the tenth Doctor’s departure by making him the star of their Christmas idents.  It saw the Doctor walking through a snowy forest, and using reindeers to pull his Tardis out of the snow to use as a sleigh.  Entertainment Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/covid-christmas-traditions-to-keep_uk_61a8a614e4b0f398af1cfe7a": "Families weren’t able to gather en masse and we couldn’t meet up with our friends on New Year’s Eve as we normally would. Fridges were either full to bursting with more food than there were guests or empty because we hadn’t planned to be home. Covid cases were high and tensions were rising. However, for some people, the change in plans actually led to a simpler and more chilled out Christmas. Not everyone sees December 25 itself as a big celebration. Some would rather spend it with a smaller group of people, rather than having everyone over or travelling for hours to be away from home. And the restrictions allowed them to do that. Additionally, it forced people to create new traditions, some of which we’d actually rather like to keep for this Christmas, whatever shape it takes. Here, readers share a few takeaways. Rich James 37, a fundraising manager from south London, found last Christmas quite refreshing as he didn’t have to factor anyone else’s needs into arrangements and could focus on creating the day his immediate family wanted. They usually spend Christmas and Boxing day alternating between his and his partner’s family homes. In 2020, they would have only been able to visit one side of the family, which didn’t seem fair. So they decided to spend Christmas in their home instead, where it was just him, his partner and their three girls. “A tradition we’re keeping from last Christmas is making a point to get wrapped up and head out for a walk. Especially when freedom to get out was limited, it was the perfect way to break up the deluge of food and tee up a Christmas film over some hot chocolate on our return,” he tells HuffPost UK. Ravi Davda, the 33-year old CEO of digital marketing agency Rockstar Marketing is someone who also usually spends Christmas either with his family (which is made up of around 40 people) or his wife’s immediate family. But in autumn 2020, between lockdowns, they left the UK and moved to Bulgaria. ”Last September, my wife and I became nomads,” he says. “Our original plan was to go back to see our families for Christmas but this didn’t work out due to Covid restrictions and also us getting Covid at the start of December. “Initially, I was upset by this. But a couple that we had recently met ended up inviting us to their house for Christmas and we had a traditional Bulgarian Christmas. They celebrate the day before Christmas, which we found different.” As Davda adds: “On the actual day, we went for a couple of walks by the beach and cooked a meal for ourselves. We also watched Christmas movies and had a few drinks. And of course, called our families over Zoom.”  The Christmas tradition he’s plans to keep is making the most out of whatever situation life throws at you.  “Our plans again are to go to see our families this Christmas, but this is looking less likely as time goes on. We also adopted a dog six months ago so we’re not sure how practical this will be! Whatever happens, we’ll enjoy ourselves.” At Christmas, Ryan Dobney, 27, a radio producer from West Lancashire, usually drives to Nottingham to be with the rest of his family. “I thought I’d miss the three hour drive, as usually we sing along to Christmas songs in the car but last year we all stayed together as a family at home.” It was just him, his mum and his nan – and all the more chilled for it. “That was the first Christmas we spent in our own home in eight or nine years,” he says. “I was able to go on walks with family, have a long lie in and play games on PS4 with my mates (usually I can’t do this as I’m away). But this year we were able to play and chat which was needed in lockdown. It felt comfortable, not rushed.” And Dobney is planning on keeping the pace of Christmas 2020 this year. “The fact I didn’t need a rest afterwards showed how relaxed it was,” he says. Life Reporter", "https://www.huffingtonpost.co.uk/entry/jimmy-carr-covid-anti-vaccine-joke_uk_61aa0b28e4b0ae9a42bb7e12": "“Let’s talk about the controversial thing, the vaccine,” Jimmy said in a preview of his upcoming Netflix special, His Dark Material, released this week. “Who’s not going to take the vaccine because they think it might be dangerous?” he asked. “Raise your hands.” Then, in response to someone in the audience who apparently did raise their hand, Jimmy delivered the punchline: “Now take that hand, and slap yourself in the fucking face.” “The spread of Covid was directly linked to how dense the population is,” Jimmy said later. “And some of the population are really quite fucking dense.” Watch the video here: And Carr’s bit from the same show on mansplaining here: “His Dark Material” is released on Netflix on Dec. 25. Reporter, HuffPost", "https://www.huffingtonpost.co.uk/entry/boris-johnson-star-quality-majority-bexley_uk_61a9c149e4b0f398af1f3601": "Oliver Dowden said he was “not worried” by Labour after the Tories’ majority in Old Bexley and Sidcup was reduced from almost 19,000 to just 4,478.  It comes after Labour claimed a 10 per cent swing over to them showed they were “winning back the trust of people”.  Tory Louie French won the election with a 51.4 per cent share of the vote, compared with Labour’s 30.8 per cent. Asked if he was worried the shine was coming off Johnson among some voters, Dowden told Times Radio: “When I was up there with with Boris he still had the same traffic stopping ability - literally.  “He tried to enter the campaign HQ at which point a load of teenage boys on the top of a red bus started shouting and screaming out the window, people charged out from everywhere.  “I don’t think Boris has lost any of his star quality. But of course the government has to continue to improve its game.” A fantastic 10.3% swing to Labour in the Conservative heartland of Old Bexley and Sidcup. If replicated at a general election Labour would be within reach of forming a majority government. https://t.co/ZffINcgXul It comes after Johnson’s handling of Covid, sleaze allegations and parties at Downing Street during lockdown were mentioned on the doorstep.  Labour’s Ellie Reeves said: “A fantastic 10.3 per cent swing to Labour in the Conservative heartland of Old Bexley and Sidcup. “If replicated at a general election Labour would be within reach of forming a majority government.” However, Dowden said he was “really not terribly worried about Labour” and it was a “good result” for a governing party mid-term. He told Sky News: “We actually secured over 50 per cent of the vote in Bexley.  “This idea that Labour have made some surge ahead is really for the birds. They’ve actually got about the same vote share as they secured under Jeremy Corbyn in 2017. “Keir Starmer couldn’t even be bothered to turn up to the by-election, so I am really not terribly worried about Labour.” This is a breaking news story and will be updated. Follow HuffPost UK on Twitter, Facebook and Instagram. Deputy Political Editor of HuffPost UK.", "https://www.huffingtonpost.co.uk/entry/booster-vaccines-omicron-study_uk_61a9479de4b044a1cc20f216": "A team studying the effects of third doses said the body’s T cell immune response after a booster shot is such that it may provide protection from hospital admission and death. The study also backs up the UK’s decision to offer Pfizer or Moderna as a third shot, with mRNA jabs leading to the most significant rise in immunity levels. Professor Saul Faust, trial lead and director of the NIHR Clinical Research Facility at University Hospital Southampton NHS Foundation Trust, said the CovBoost study had shown that six different vaccines are safe and effective as booster doses for people who have already had two doses of AstraZeneca or Pfizer/BioNTech. The six vaccines tested as a third dose were AstraZeneca, Pfizer/BioNTech, Moderna, Novavax, Janssen (made by Johnson and Johnson) and CureVac (which has ceased production). “All of the vaccines in our study do show a statistically significant boost… RNA (Pfizer and Moderna) very high, but very effective boosts from Novavax, Janssen and AstraZeneca as well,” Prof Faust said. He added that the vaccines worked well against existing variants, although Omicron was not tested in the study. However, experts think that T cell immunity – which was studied alongside antibodies in the research – could also play a significant role in fending off the variant. T cells play a key role and work alongside antibodies in the immune system to target viruses. “Even though we don’t properly understand its relation to long-term immunity, the T cell data is showing us that it does seem to be broader against all the variant strains, which gives us hope that a variant strain of the virus might be able to be handled, certainly for hospitalisation and death if not prevention of infection, by the current vaccines,” Prof Faust said. He said T cell response was not just focused on the spike protein but “are recognising a much broader range of antigens that might… be common to all of the variants.” Asked specifically about Omicron, he said: “Our hope as scientists is that protection against hospitalisation and death will remain intact.” Samples from the study have now been passed to the UK Health Security Agency (UKHSA) to look at how well the Omicron variant can be neutralised by vaccines. Jonathan Ball, professor of molecular virology at the University of Nottingham, said of the new research: “This is a fantastic study and it’s great to finally see the data that was no doubt pivotal in deciding the UK’s vaccine booster approach. “The data clearly shows that all boosters provided a lift to at least one aspect of your Covid immunity, and that side effects were, on the whole, mild. “The data also shows that an mRNA booster – such as Moderna or Pfizer – provided the best overall boost, irrespective of whether your first doses were mRNA or (AstraZeneca). “The fact that the mRNA vaccine boosts gave a marked increase in both antibodies and T cells is great news, especially now, when our attention has been grabbed by the emergence of the Omicron variant. “We still don’t know how this increase in immunity translates into protection, especially against serious disease, but I am still convinced that our vaccines will continue to provide the protection that we need.” The new CovBoost trial, published in The Lancet, involved 2,878 people aged 30 or over receiving a booster 10 to 12 weeks after their initial two-dose vaccination. Overall, there were 13 different groups testing the boosters or acting as controls, with controls given a meningitis vaccine. Immunity was then assessed after 28 days, with experts saying that more data will be published in the future on the immunity results three months and one year after receiving boosters. More data will also be published early next year looking at whether a longer period between second and third doses improves the response. All seven vaccines posed no safety concerns, according to the study, with fatigue, headache and sore arm the most commonly reported issues. Prof Faust said: “It’s really encouraging that a wide range of vaccines, using different technologies, show benefits as a third dose to either AstraZeneca or Pfizer/BioNTech. “That gives confidence and flexibility in developing booster programmes here in the UK and globally, with other factors like supply chain and logistics also in play.” When looking at antibody levels in the trial, people who had received two doses of AstraZeneca initially had booster responses that were between 1.8 times higher to 32.3 times higher depending on the booster vaccine used. After two doses of Pfizer, the range was 1.3 times higher to 11.5 times higher. The authors said these ratios should be interpreted with caution because they relate to immune response rather than real-world protection against disease.", "https://www.huffingtonpost.co.uk/entry/hack-for-stringing-christmas-lights-on-tree_uk_5fcf401ac5b626e08a2cb048": "That’s according to 46-year-old Clare Hooper whose life hack for lighting up a Christmas tree has gone viral on TikTok.  In a video, which has had 2.4 million views, Hooper can be seen stringing her fairy lights from the bottom of the tree right up to the top, and back down again, so the lights fall vertically. “If you are coiling your Christmas lights you are doing it wrong,” Hooper says in her Christmas lights life hack video, posted at the end of November. “Decorating Christmas trees used to be part of my job. We used the zigzag method, it means you don’t waste lights around the back of your tree and if a set breaks you can take them off really easily.” Her quick tutorial has inspired others to share videos of their tree lights hung with the zigzag method too – and we have to admit, it does look great. Life reporter at HuffPost UK", "https://www.huffingtonpost.co.uk/entry/best-christmas-markets-in-uk_uk_619cf063e4b0451e54ff44e1": "In a regular year, many of us might be hopping over to continental Europe for some shopping and glühwein action: Amsterdam, Prague and cities across Germany are all known for their marvellous Christmas markets. With rising Covid cases across Europe, this isn’t the best time for going abroad, but don’t worry – there’s a plethora of market action to be had here in the UK. Say goodbye to December minibreaks and hello to Christmas staycations. Read on for six great markets that are well worth the festive day trip. The Malton Christmas market in north Yorkshire runs on the first weekend of December. Enjoy mulled wine, gin and beers as well as a fine array of foodie delights, all while listening to live music from local brass bands and choirs. Situated beneath the backdrop of one of Oxfordshire’s most impressive stately homes, the Blenheim Palace Christmas Market is running until December 19. The market features 70 designer/maker craft traders, housed in traditional wooden chalets in the Great Court of the palace, selling a range of artisan products that will make the best treats and gifts this Christmas. The Festival Flea near London’s South Bank is a great pickup spot for vintage and thrifted Christmas presents. The market is supporting local and independent traders and small businesses during a difficult year, with more than 40 stalls of beautiful handcrafted Christmas gifts. Enjoy the festivities alongside a warming mulled wine – the perfect activity to get into the Christmas spirit. Swansea’s market gathers talented crafters, traders and street food vendors. There’s a festival bar area with sheltered, cosy seating – perfect for a well-earned break from shopping for gifts and decorations. Enjoy mulled wine, gin, German beer or a cup of coffee while the kids ride on the beautiful carousel.  Each weekend in the run up to Christmas will feature a different line-up of new and established brands in the wooden cabins of the Curated in the Quad market at Marischal College. Shoppers can choose from a range of handmade gifts, unique pieces of art and locally crafted food and drink, with visitors urged to shop local and support independent traders amid the twinkling fairy lights.  This Christmas Market spreads across Kings Cross, featuring an eclectic mix of independent and boutique brands, designers, creatives, and craft makers. Visitors can dip into a range of activities and shopping areas. Eat, drink, shop and even take a spin around Coal Drops Yard’s very first Club Curling rink. Life Reporter", "https://www.huffingtonpost.co.uk/entry/most-effective-booster-jabs-omicron_uk_61a9f456e4b07fe201260ed3": "Newly published research from the ongoing CovBoost study into vaccines, shows that six different vaccines are safe and effective as booster doses for people who have already had two doses of AstraZeneca or Pfizer/BioNTech. The latest CovBoost trial, published in the Lancet, involved 2,878 people aged 30 or over who received a booster 10 to 12 weeks after their initial two jabs.  The six vaccines tested as a third doses were AstraZeneca, Pfizer/BioNTech, Moderna, Novavax, Janssen (made by Johnson and Johnson) and CureVac (which has ceased production). “All of the vaccines in our study do show a statistically significant boost,” says Professor Saul Faust, trial lead and director of the NIHR Clinical Research Facility at University Hospital Southampton NHS Foundation Trust. He stressed that while the boost delivered by the two mRNA vaccines – Pfizer and Moderna – was “very high”, Novavax, Janssen and AstraZeneca also delivered “very effective boosts”. Although the newly emerged Omicron variant was not tested in the study, the study showed that booster vaccines are working well against existing variants. Asked specifically about Omicron, Prof Faust said: “Our hope as scientists is that protection against hospitalisation and death will remain intact.”  “It’s really encouraging that a wide range of vaccines, using different technologies, show benefits as a third dose to either AstraZeneca or Pfizer/BioNTech,” said Prof Faust. “That gives confidence and flexibility in developing booster programmes here in the UK and globally, with other factors like supply chain and logistics also in play. Additionally, researchers think that T cell immunity, which was studied alongside antibodies in the research, could play a big role in fighting off the new variant.  “Even though we don’t properly understand its relation to long-term immunity, the T cell data is showing us that it does seem to be broader against all the variant strains, which gives us hope that a variant strain of the virus might be able to be handled, certainly for hospitalisation and death if not prevention of infection, by the current vaccines,” Prof Faust said. When looking at antibody levels in the trial, people who had received two doses of AstraZeneca initially had booster responses that were between 1.8 times higher to 32.3 times higher depending on the booster vaccine used. After two doses of Pfizer, the range was 1.3 times higher to 11.5 times higher. There were 13 different groups testing the boosters or acting as controls, with controls given a meningitis vaccine. Immunity was then assessed after 28 days, with experts saying that more data will be published in the future on the immunity results three months and one year after receiving boosters. Jonathan Ball, professor of molecular virology at the University of Nottingham, commented: “This is a fantastic study and it’s great to finally see the data that was no doubt pivotal in deciding the UK’s vaccine booster approach. “The data clearly shows that all boosters provided a lift to at least one aspect of your Covid immunity, and that side effects were, on the whole, mild.” He added: “The data also shows that an mRNA booster – such as Moderna or Pfizer – provided the best overall boost, irrespective of whether your first doses were mRNA or (AstraZeneca). The fact that the mRNA vaccine boosts gave a marked increase in both antibodies and T cells is great news, especially now, when our attention has been grabbed by the emergence of the Omicron variant.” Samples from the study have now been passed to the UK Health Security Agency to look at how well the Omicron variant can be neutralised by vaccines. More data will be published early next year looking at whether a longer period between second and third doses improves the response.  Life Reporter", "https://www.huffingtonpost.co.uk/entry/how-therapists-prevent-themselves-from-catastrophising_uk_61a7ad81e4b0f398af1b2dde": "“Catastrophising is that not-so-fun trick your brain tries to play on you where you get caught in this death spiral of extreme ‘what ifs’ that may push you into panic, immobility or fight-or-flight mode,” said Megan Rhoads, a clinical psychologist in California. “To put it simply, as the planning and executive functioning part of our brains (the prefrontal cortex) gets stimulated with worry and over-planning, it sends a stress signal to the primitive part of our brains (the brain stem),” she continued. “Since the brain stem is less developed and cannot reason through the difference between stress being a saber-toothed tiger and stress meaning it will rain tomorrow, we overreact and move into hyper-drive, trying then to think of every possible scenario that we may need to address. This causes us to catastrophise as a means of survival.” In other words, your brain is trying to protect you by making you believe the world is out to get you. Luckily, you aren’t alone in this. Everyone deals with catastrophising at some point – even therapists. Here’s how they tackle it: Anna Zuidema, the clinical director of Good Life Therapy, said that her go-to method for combating thoughts of catastrophe is to question them. This approach helps to confront and challenge these automatic thoughts in the present moment to identify whether there’s an actual threat, or if it’s a product of our negative thinking patterns. “When faced with a negative thought, I stop and ask myself, ‘What’s the evidence that I have for that thought?’ I look at it and ask myself if it makes sense – is it realistic or rational?” she explained. By doing this, you’ll realise that your worst-case thoughts aren’t actually rooted in facts. When this happens, Zuidema said she then challenges herself to “come up with ways it isn’t and question what else it could be.” After you’ve interrogated your thoughts, if they’re not rooted in facts, then this would be a good time to try reframing – a tactic that works for Shagoon Maurya, a counselling psychologist and psychotherapist who works with clients virtually. “Challenge your negative thoughts by coming up with at least three other ways that situation could go. Furthermore, replace the pessimistic outcome with an optimistic one. This will help your brain incorporate more possibilities and therefore have a realistic approach,” she said.  Ibinye Osibodu-Onyali, a licensed marriage and family therapist at The Zinnia Practice, said she finds it helpful to name her emotions.  “[When I realise I’m] making a mountain out of a molehill and that the mountain is built on fear, anxiety or stress, I name my emotions, validate the emotions, take a 10-minute timeout to breathe, and then I come back to tackle the situation,” she said. “If I can’t seem to get out of these thought spirals, I reach out to a loved one who is very rational. They help walk me through the thought spirals and remind me that it is my fear or anxiety talking. Once I have calmed down, I can then work on problem-solving.” People often say awareness is the first step, and this is the case for Rhoads. Being aware of what triggers your catastrophising will ultimately help you to stop this thought pattern. Rhoads said her triggers include not taking enough breaks during the workday, being “hangry,” having a problem she can’t immediately solve and being anxious.  “I try to plan for those events and things as best as I can,” Rhoads said. “Always having a snack on-hand, asking for help in solving a problem, talking to my partner about how we’re going to tackle said anxiety-provoking situation, etc.” In a similar manner, if your trigger is associated with doom-scrolling, then taking some time away from social media might be a good place to start. Once you’ve put down your phone and closed your laptop, consider grabbing your journal. According to Brian Wind, a clinical psychologist and chief clinical officer of Journey Pure, journaling can be a great way to deal with catastrophising. “It’s a way of expressing the thoughts in my head. I write about what worries me and the events leading up to it,” he said.  After that, he implements a couple practices mentioned above.  “Next, I challenge my worries and write down other possible outcomes that could also happen with equal probability. This helps me reframe my mind, challenge anxious thoughts and acknowledge that there can be other possible outcomes other than the worst-case scenario that I’m imagining,” he explained. “Mindfulness and acceptance are the two major antidotes to catastrophizing,” said Noël Hunter, licensed clinical psychologist and director of MindClear Integrative Psychotherapy in New York. “The key is being able to notice when the what-if spiral is beginning and try to bring yourself back to the present moment.” You can do this by implementing a few breathing techniques, like inhaling for four seconds and exhaling for four seconds. You can also do a grounding exercise: Mentally acknowledge five things you can see, four things you can touch, three things you can hear, two things you can smell and one thing you can taste. Do this until you’re more fully in the present moment. “Yes, terrible things might happen tomorrow, but right here at this moment I am just fine,” Hunter added. “Building up the resilience to accept that we can’t control bad things from happening is what can allow us to essentially get off the what-if train.” For Shannon Garcia, a psychotherapist at States of Wellness Counseling, addressing her own mind helps to kick her catastrophising. “I will say to my brain, ‘thank you, but no thank you,’” she said. “This acknowledges that my brain felt there was a threat and at the same time the catastrophising thought is not needed right now. It’s my way of turning off that anxiety alarm.” For the moments when challenging and reframing the thoughts feel like too much effort, consider a temporary distraction.  “I use distraction when challenging the thoughts is difficult,” Garcia said. “If it’s a particularly stubborn catastrophising thought, I will do something else to give my brain a rest. That might be watching a funny TV show or going for a walk with my husband and kid.”  Constantly sorting through thoughts of worst-case scenarios can probably feel exhausting. Be kind to yourself during this time, said Avigail Lev, a psychotherapist in California.  “Practice using self-compassion techniques to make friends with these difficult feelings and sensations,” she said. “Put your hand on your heart, gently rubbing it and sending it warmth and comfort. Stay present and kind with your experience in the same way that you would with a crying baby. Bringing the experience closer, staying loving and kind with it, and making space for all these difficult emotions and sensations in your body.” Lev added that if it helps, try repeating some compassionate phrases to yourself. For example, “it makes sense that I feel scared” or “it makes sense that I feel helpless in this situation.” Even your therapist has a therapist. If you find that you absolutely can’t stop catastrophising and it appears to be causing you anxiety, it might be time to see a professional, Osibodu-Onyali said. “Sometimes catastrophising can also cause you to feel stuck and unable to take action,” Osibodu-Onyali added. “It could also cause you to become impulsive and make decisions that you otherwise regret. Also, if catastrophising is causing you emotional distress, adversely affecting your relationships with others or your work, then it might be wise to speak to a professional.” On Assignment For HuffPost", "https://www.huffingtonpost.co.uk/entry/covid-omicron-variant-life-normality_uk_61aa32f5e4b025be1af718bc": "The Office for National Statistics (ONS) has released new figures showing that the public’s attitude towards Covid has become increasingly downbeat since around March. The general mood seems to have reached an all-time low after the World Health Organisation (WHO) declared Omicron was a “variant of concern” at the end of November. According to ONS’ findings in the Opinions and Lifestyle Survey, 16% of adults surveyed between November 18 and November 28 think life will never return to normal. There’s been a slight dip in the number of people who believe it will take just more than a year to get back to normality as well – now a third of respondents believe this, compared to 36% previously. An optimistic 4% of respondents claim getting back to normal life is just four to six months away. These results came in shortly before the new social distancing measures were put in place on Tuesday. Only eight in nine people thought everyday life would go back to pre-pandemic lives just a month ago – during the summer, this statistic was even higher with nine in 10 respondents feeling normality would soon return. Although the second wave of Covid was at its peak in January 2021, people were more optimistic that life would be able to revert to normal even then. Just a small fraction – only 3% – of adults said at the time that life would never be the same again at that time, when the UK was in its third lockdown. The government appears to be expecting similar booster campaigns to be necessary against other Covid mutations in the future, as Downing Street has ordered millions of extra vaccine doses for 2022 and 2023. Speaking on BBC Question Time, the vaccines minister Maggie Throup acknowledged that annual vaccinations are likely to be needed and “it would be wrong of us not to be prepared”. However, the health secretary Sajid Javid has signalled that if the Omicron variant is only as transmissible as the Delta variant – rather than more infectious – he intends to lift all of the current social restrictions. The government has also encouraged people to continue with their social plans this year, as long as everyone takes “cautious” measures. Senior Trends Reporter, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/no-plan-uk-germany-compulsory-vaccine-boris-johnson_uk_61a9ff78e4b07fe2012635f3": "A spokesman for Boris Johnson insisted they had “no plans” to make vaccinations mandatory. It comes after Germany announced sweeping new restrictions for unvaccinated people to curb the spread of coronavirus infections. Chancellor Angela Merkel has described the measures as an “act of national solidarity” in response to a “very serious” situation in Germany. Only those who have been jabbed or recently recovered from the virus will be allowed in restaurants, cinemas and many shops. Asked if it could ever happen here, the spokesman replied: “We’ve set out our policy on this and we’ve said it’s not something that we would look to introduce. “You’re aware of the changes we made in terms of social care settings and for NHS workers, given the importance of protecting the most vulnerable in our society. But there’s no plans above and beyond that, in that regard.” Asked about separate lockdown measures for the unvaccinated, he said they would set out any changes in the usual way. Pressed on the matter, he replied: “We have no plans to make vaccinations mandatory. “You can look back at the restrictions we’ve had previously and the fact that we’ve never introduced something along those lines. “Our priority is to continue to promote vaccinations and promote boosters now that we’re rolling out more and more boosters to more and more people, that is our priority. “That’s our focus and that’s what we’re asking people to come forward and take.” Pressed again, he replied: “I’ve been clear that we’re not looking at introducing compulsory vaccinations.” Merkel has said that vaccinations could be made mandatory for Germans by February. The country is experiencing its fourth wave of Covid - its most severe so far - coupled with concerns about the spread of the Omicron variant. Deputy Political Editor of HuffPost UK.", "https://www.huffingtonpost.co.uk/entry/covid-risk-black-and-asian-brits_uk_61a9ead4e4b044a1cc21c76d": "Almost two years on, that risk hasn’t subsided, despite governments being aware of official data pointing to the fact. Now new research points out that nothing has changed. The risk of catching Covid and getting severely sick or dying from it remains higher among Black and Asian people. The study, commissioned by the government, looked at each wave of the pandemic and those hardest hit. It found that these ethnic groups were consistently most affected by Covid deaths and illness, for a range of complex reasons. The biggest risk factors for Covid-related deaths are still age and underlying health conditions, but other important factors relate to the disproportionate figures for Black and Asian people. The factors that make Black and Asians more susceptible to Covid: Occupation (particularly for those in frontline roles, such as NHS workers), living with children in multigenerational households, and living in densely-populated urban areas with poor air quality and higher levels of deprivation Once a person is infected, factors such as older age, male sex, having a disability or a pre-existing health condition (such as diabetes) are likely to increase the risk of dying from Covid-19 While ethnicity itself was not thought to be a risk factor, recent research by Oxford University identified the gene responsible for doubling the risk of respiratory failure from Covid-19, carried by 61% of people with South Asian ancestry – this goes some way to explaining the higher death rates and hospitalisations in that group. In previous research by the government, it found that the rate of Covid deaths were highest for the Black African group (3.7 times greater than for the White British group for males, and 2.6 greater for females), followed by the Bangladeshi (3.0 for males, 1.9 for females), Black Caribbean (2.7 for males, 1.8 for females) and Pakistani (2.2 for males, 2.0 for females) ethnic groups. In the second wave of the pandemic (from September 12 2020 onwards), the differences in Covid-19 mortality compared with the white British population increased for people of Bangladeshi and Pakistani ethnic backgrounds; the Bangladeshi group had the highest rates, 5.0 and 4.1 times greater than for white British males and females respectively. Experts are now urging those who aren’t vaccinated, particularly from these cohorts, to get jabbed and get the booster if eligible. The government is also planning to work with faith and community leaders, open pop-up vaccine and booster centres, and host webinars and produce videos to encourage vaccine uptake among South Asian and Black communities, in the hope of address the disparities. The review also admitted some of the ways the government has previously neglected these groups in the pandemic. Going forward, it said the government will: Not be treating ethnic minorities as a homogenous group – Covid-19 has affected different ethnic groups in different ways throughout the pandemic and a ‘one size fits all’ approach is not an effective way of tackling public health issues Avoid stigmatising ethnic minorities by singling them out for special treatment, which could be taken to imply that they are vulnerable or, in the case of Covid-19, were somehow at fault for the spread of the virus Improve the quality of health ethnicity data so that patterns and trends can be spotted quicker in future If you’re from these groups (or part of any other), don’t forget that booster jabs are now being given at walk-in vaccination sites across England, with no appointment needed. From November 1, anyone eligible who had their second dose of a coronavirus vaccine at least six months ago can turn up at one of hundreds of jabs sites across the country to get their top up. The move is part of plans to ramp up vaccine uptake ahead of a “challenging” winter. Walk-in centres are also offering vaccinations to 12-15 year olds needing their first jab, and parents should check the ‘Grab-a-Jab’ website to find their nearest centre, which is updated each day as new sites open up. Life Reporter", "https://www.huffingtonpost.co.uk/entry/christmas-confusion-downing-street-christmas-party_uk_61a8b06ae4b0ae9a42b8ab76": "The prime minister’s official spokesman insisted that this year’s celebrations are down to “individual judgement”. It comes after ministers threw government messaging into chaos by giving different advice on how to socialise this Christmas.  This morning science minister George Freeman revealed he had cancelled his work Christmas party and they would instead be marking the festive season via Zoom. Asked why government departments were cancelling their Christmas parties, the PM’s spokesman said: “The prime minister has been very clear on this. And on Christmas parties, we don’t want people to cancel such events.  “There is no government guidance to that end. It is right that post step four, we return to the position where people can use individual judgement.” Asked if No10 was having a Christmas party, he replied: “I think, as you know, there was an event for switching on the lights just this week and we continue to set out any future plans.” Pressed on if there were plans for a party, he replied: “We will host a number of in person events in the run up to the holidays and we’ll update in the normal way.” Asked what an “in person event” was, he replied: “There’ll be a number of events in Downing Street as we do we’ll set out any detail in the normal way.” Boris Johnson has told people not to cancel their Christmas parties and health secretary Sajid Javid recommended taking a test beforehand and potentially wearing a mask. Work and pensions secretary Therese Coffey suggested “no snogging” under the mistletoe and Freeman suggested gatherings of “four or five staff”. It also follows a split between the government and scientific advisers over socialising. Earlier this week Jenny Harries, head of the UK Health Security Agency, said people should try to reduce their social contacts. Deputy Political Editor of HuffPost UK.", "https://www.huffingtonpost.co.uk/entry/we-need-to-talk-about-the-global-pet-homelessness-crisis_uk_61782232e4b079111a5d1994": "Despite the connection between pets and humans, not every dog and cat will find their “forever home.” In fact, the number of pets around the world living on the streets is devastating and staggering. Across the continents, there are millions of cats and dogs with inadequate food and care.  According to Mars Petcare’s new State of Pet Homelessness Index, there are 224 million homeless cats and dogs in the nine countries in Europe, North America, Asia and Africa that the Index currently measures. Homeless pets aren’t only those found on the streets, but pets who have been returned to shelters and rescues, who don’t have sustained human care and companionship. This includes 19 million homeless cats and dogs living in shelters in countries like India, Mexico, Germany, the USA and the UK. Ending pet homelessness is Mars Petcare’s bold ambition. The company has been serving the health and nutrition needs of the world’s pets for over 85 years and its portfolio includes household brands like Banfield™ , Pedigree®, Whiskas® and Royal Canin®.  “As we continue to navigate an extraordinary global health crisis, for many of us, pets have undeniably been much-needed companions throughout it all. At Mars Petcare, we know that pets make our lives better and the record number of people turning to pet ownership during this time might agree,” says Helen Mills, vice president of Global Corporate Affairs and Sustainability at Mars Petcare. Up until this point, there’s been no consistent way to measure and track the progress of various initiatives to decrease the numbers of cats and dogs on the streets or in shelters. Mars Petcare has launched the State of Pet Homelessness Index in collaboration with animal welfare experts in order to measure the scale of cat and dog homelessness by country. For the first time, there is a clearer picture of the vast scope of the problem and how it manifests around the world. It collects data from over 200 global and local sources to measure the pet homelessness problem by country, which in turn can help animal welfare groups and companies like ours to identify practical steps to address this issue across the globe and to help see what’s working — and what isn’t.  “Around the world, millions of cats and dogs remain in shelters or living on the street. We believe they deserve more and tackling this issue is central to our purpose: A Better World For Pets. So we set out to understand the scale of the problem as a crucial first step. That’s why we partnered with leading animal welfare experts and organisations to develop the State of Pet Homelessness Index,” explains Mills. “Now, with initial data for nine countries, we have a clearer picture of homeless pet populations and insight into the most impactful underlying issues by country, as well as a means to track the effectiveness of interventions over time. By working to define the size of the issue and understand the root causes of homeless pets at a more granular level, we hope this will drive a profound impact on the problem. Because the world we want tomorrow is one where no pets are homeless.” So what’s next? The data collected in the Index can now be used by animal welfare organisations, policymakers and researchers to help better understand pet homelessness in their countries and to work toward ensuring all pets get the care they deserve, for their entire lifetime. You can learn more about the State of Pet Homelessness Index by visiting endpethomelessness.com. State of Pet Homelessness Index data provided by Mars Petcare.", "https://www.huffingtonpost.co.uk/entry/50-cent-madonna-apology-instagram-photos_uk_61ab565fe4b025be1af8436a": "The Vogue singer made headlines last month with a provocative bedroom photoshoot taken in (and under) her bed. 50 Cent had reshared the snaps, including the one of her under the bed, comparing her to the Wicked Witch of the East from The Wizard of Oz, where Madonna’s legs where photoshopped under a house from film.  He added: “Starz ask me to do a remake, I said only if Madonna is gonna play the role because i need star power and sex appeal in this one.” In another caption, he wrote: “That’s Madonna under the bed trying to do Like A Virgin at 63. She shot out, if she don’t get her old ass up.” After his comments caught Madonna’s attention, she issued a scathing response on Instagram.  A post shared by Madonna (@madonna) Posting on her Story, she wrote: “Here is 50 Cent pretending to be my friend. Now you have decided to talk smack about me! “I guess your new career is getting attention by trying to humiliate others on social media, the least elevated choice you could make as an artist and an adult. “You’re just jealous she won’t look as good as me or have as much fun when you’re my age! Too bad there are no sour grapes emojis.” Madonna then posted a video of her with a green alien filter, where she added: “Cheer up, things could be worse, you could be me for instance. Personally, I like the way I look, but there are those that find it hard to appreciate people and things that are different.  “And they try to shame me or humiliate me or make me feel less than because I am not like everyone else. “But in fact, I cherish my uniqueness and I’ve grown stronger because to be unique is to be rare.”  50 Cent has now issued an apology on Twitter, writing: “I must have hurt Madonna feelings, she went and dug up a old MTV photo from 03. Ok I’m sorry I did not intend to hurt your feelings. “I don’t benefit from this in anyway I said what I thought when I saw the picture because of where I had seen it before I hope you accept my apology.” 👀 I must have hurt Madonna feelings,she went and dug up a old MTV photo from 03🤷🏽‍♂️ok Im sorry i did not intend to hurt your feelings.I don’t benefit from this in anyway i said what i thought when i saw the picture because of where i had seen it before i hope you accept my apology pic.twitter.com/Kd0EdT5R95 50 Cent’s original posts no longer appear on his Instagram page.  Madonna previously called out Instagram for removing one of the photos from her photoshoot due to the fact that one of her nipples was exposed. She fumed: “It is still astounding to me that we live in a culture that allows every inch of a woman’s body to be shown except a nipple. As if that is the only part of a woman’s anatomy that could be sexualised. The nipple that nourishes the baby! “Can’t a mans nipple be experienced as erotic??!! And what about a woman’s ass which is never censored anywhere.” Entertainment Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/the-masked-singer-uk-series-3-characters-costumes_uk_61ab36f5e4b0ae9a42bd15f5": "The madcap ITV singing show is returning to our screens next month, as viewers will once again have to guess “who’s that behind the mask?”.  The costumes the mystery celebrities will be hiding in include an elaborate Robobunny, a Traffic Cone and a Chandelier.  There’s also an entire outfit styled on doughnuts and another on bagpipes, while there’s also additions from the animal world, including Lionfish, Poodle, Panda and Snow Leopard.  Take a look at all the costumes in all their glory below... Joel Dommett will once against host the reality singing competition, which is due to begin in the new year. Davina McCall, Rita Ora, Jonathan Ross and Mo Gilligan are returning as the celebrity panel to guess the identities of the disguised stars performing in elaborate costumes in front of them. The first series of The Masked Singer was won by Girls Aloud star Nicola Roberts, who performed as Queen Bee, while singer Joss Stone, who was dressed as Sausage, took the crown during the second season. Last year’s show also featured celebrities including American singer Ne-Yo, comedian Sue Perkins, Spice Girl Mel B, JLS star Aston Merrygold and former footballer and manager Glenn Hoddle. The Masked Singer UK returns to ITV in January. Entertainment Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/louise-redknapp-ex-jamie-new-wife-baby_uk_61ab2da0e4b0ae9a42bd0f7e": "The former Eternal singer was the subject of a story in this week’s Heat magazine which detailed her supposed feelings about Jamie and Frida welcoming their first child together last month.  However, Louise has shot down the reports in a post on Twitter, insisting she is “not in despair or anything like it”, adding that she is in “the most positive of headspaces and loving my life”. .@heatworld pic.twitter.com/vNhDZZ9QAA “I try not to read or respond to these things but sometimes they’re unavoidable,” she wrote. “I’d really love to clarify that ‘Louise’ is not in despair or anything like it!! “I have my two gorgeous boys that I adore more than anything in the world, the best family around me and I’m having the best time of my life in my career and with the most wonderful friends that a girl could hope for.” “These stories are there to sell magazines but I’d like to make it clear that I’m in the most positive of headspaces and loving my life. Here’s to all the ladies out there that are in control of their lives and living their very best lives. Addressing the magazine directly, she added: “Come on @heatworld magazine, women are better than this… x.” Louise split from former footballer Jamie in 2017 after 19 years together. The former couple are parents to sons Charley, 17, and Beau, 13. Jamie married Frida in a low-key ceremony in London in October, where they were surrounded by 30 of their closest friends and family. They were reported to have started dating last year.  The newlyweds announced the arrival of their son Raphael Anders Redknapp in a sweet Instagram post last month.  “We’re so in love, mum is doing so well too,” Jamie said. “We can’t thank the amazing doctors and nurses at the Chelsea and Westminster enough. So excited for him to meet my boys.” Entertainment Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/steph-mcgovern-swimming-cold-water-leeds-dock-packed-lunch_uk_61aa355ce4b044a1cc22a8c8": "However, Steph McGovern found herself talked into taking a cold water swim on Friday’s edition of Steph’s Packed Lunch, and it’s fair to say she had the same reaction we would have.  The presenter was left screaming after persuaded to try out the sport by former Gogglebox star Reverend Kate Bottley.  As she entered the six-degree water, Steph exclaimed: “What is fun about this Kate?!” and then proceeded to yelp repeatedly.  Steph tried to adjust to the chilly temperatures, Kate described the benefits to cold water swimming.  She said: “It is like pressing a reset button on your mental, physical and spiritual health. It is the single best thing I have ever done. I’ve been doing it for about three years now and it is transformative. It’s transformed how I feel about myself, it clears the head, it gets the blood flowing.” However, Steph will not be trying it out again in a hurry, as after returning to the studio in a dressing gown and wolly hat, she swore off the sport forever.  It’s not the first time a member of the Packed Lunch team has ended up in the dock, though. Earlier this year, Strictly Come Dancing’s John Whaite tried paddleboarding in the waters outside the studio, but it wasn’t long before he’d fallen in.  Still, at least he’s a lot better at dancing than he is at paddleboarding.  Steph’s Packed Lunch airs weekdays at 12.30pm on Channel 4.  Entertainment Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/adele-love-island_uk_61aa04ebe4b0ae9a42bb6e4e": "The Easy On Me singer has made it clear she is no fan of the ITV2 reality series, saying she would rather watch David Attenborough documentaries.  In an interview with YouTuber Nikkie de Jager, Adele said of Love Island: “I can’t bear that show. My son’s dad loves stuff like that.  “I remember one time trying to get into it when I was home for a summer doing shows... I couldn’t believe it! “She was like, ‘I hope my mum is proud of me,’ and I was like... They’re all having fucking sex on TV!” When Nikkie explained the concept of a similar show called Temptation Island, where couples go onto an island and are split up and have to resist cheating, Adele said: “They voluntarily go on this show?! People will do anything to be famous, it’s insane.” Speaking about the TV she does enjoy, Adele said: “I do watch mind-numbing TV, but if I have the urge to do it unnecessarily, I will watch something that I can actually learn from. Educational.” She named David Attenborough documentaries and wildlife programmes as shows she likes to watch.  Watch the full interview with Adele below... Entertainment Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/craig-revel-horwood-james-jordan-rose-ayling-ellis-strictly-come-dancinng_uk_61a8b076e4b044a1cc1f58c5": "Last week James, who was axed from Strictly in 2014, critiqued EastEnders star Rose in his Hello column following her Frozen-themed Quickstep from Musicals Week. He wrote: “Their dance was a perfect example of when the theme of the musical takes over from the quality of the dancing.” Craig has now called out his former Strictly colleague, calling his verdict “crazy” as he heaped praise on the soap star. He told The Mirror: “I mean, that’s just crazy, she’s absolutely wonderful and I think she’s incredible... So I completely disagree with him.” Craig then reignited his age-old rivalry with James, saying he was “desperate” for his job on the judging panel. “I think he’s obviously just trying to make headlines and get a job as a judge,” he said. “He’s always wanted that. He’s desperate for my job, but he’ll never get it.” Last year, Craig labelled James “bitter and twisted” after the pro praised everyone on the show – except for the judges in a tweet. “[Strictly] gave us all some needed joy,” James tweeted. “All the pros and celebs have been brilliant and worked their socks off to entertain us all. “The hair, makeup and costume team and everyone behind the scenes. However, the judges need a bit of improvement.” “He would say that,” Craig later told OK!. “Honestly, we won’t make amends until he stops slagging me off! “His comments and scores on Twitter always tally up with mine. He thinks the same as I do and it makes me laugh because he clearly wants my job!” On whether he saw a spot on the panel in James’ future, Craig continued: “Not in a million years. He’s too bitter, he’s too twisted!” Head of Entertainment, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/craig-revel-horwood-strictly-come-dancing-results-fixed_uk_61a88798e4b044a1cc1ec81c": "Last month, under a headline about a “Strictly fix row”, The Sun highlighted that of the past 18 Strictly winners, eight of them have been BBC stars prior to signing up, including Stacey Dooley, Ore Oduba and original winner Natasha Kaplinsky. The BBC quickly dismissed the story, rubbishing the claims outright and insisted that the “winner of Strictly is decided by the public vote” alone. That hasn’t stopped many viewers also accusing the show of being “fixed” each week. But Craig - who judges the show with Motsi Mabuse, Shirley Ballas and Anton du Beke - has broken down why that isn’t true. “It’s sort of impossible and I can tell you why,” he told The Mirror.  “We have to vote personally on a keypad, and we have to push that keypad within seven seconds of the dance finishing and we can’t change our minds. “Once we’ve chosen a mark, that is it and we don’t know what the other judges are choosing until it’s too late.  “Not until we get our paddles ready to vote do I know what everyone has voted. “Because I have given fours when other people have given nines! So I go, ‘Wow!’ So I’m as shocked as everybody else because it’s their own personal opinion and no one can change it. So once I’ve done it, it’s too late.” However, Craig did admit that he has accidentally pressed the wrong number in the past - but not during a live show. “That has happened on tour,” he admitted. “The four is next to the seven and I wanted to give a four but a seven showed up on the keypad and I went, ‘Oh.’ But I was on tour so I just went, ‘Oh, erm, OK!’ So then I had to go with a seven so I chose to say all the positive things rather than the negatives. “But that’s only ever happened once and that happened on tour, which was a bit alarming. Yeah, you’ve got to be careful where the finger goes, darling! You have to be quite specific. Thankfully it didn’t happen on live TV - that would be a nightmare.” Earlier this week, BBC Breakfast presenter Dan Walker once again found himself having to fend off criticism from viewers after managing to last another week without landing in the dance-off. Dan and his professional partner Nadiya Bychkova have landed enough support from the public to have avoided being in the bottom two every single week, which has led some viewers to accuse the show of being rigged. Thank you to everyone who is sending lovely messages & enjoying us having fun on #Strictly and to the few who say…“Just leave”“Aren’t you ashamed?”“You’re a disgrace”“It’s a fix” (which I don’t get)or“Who is voting for them?”IT’S A TV SHOW!See you in the 1/4 finals 😂 pic.twitter.com/40eCNBfOYz However, Dan made it clear he wasn’t going to allow their comments to get him down, tweeting after the show: “Thank you to everyone who is sending lovely messages and enjoying us having fun on Strictly... “And to the few who say… ‘Just leave’, ‘Aren’t you ashamed?’, ‘You’re a disgrace’, ‘It’s a fix’ (which I don’t get) or ‘Who is voting for them?’... IT’S A TV SHOW!” Strictly Come Dancing returns on Saturday night at 6.40pm on BBC One. Head of Entertainment, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/strictly-come-dancing-rhys-stephenson-crying-tess-daly-comments_uk_61a7a652e4b0451e550fbd42": "The CBBC presenter became emotional after he performed a Waltz to Whitney Houston’s You Light Up My Life with professional partner Nancy Xu on Saturday.  As they awaited the judges’ comments, Tess made a series of comments asking if he was “having a little cry”, which some viewers believed were “condescending”.  Tess being v v condescending to Rhys there... #strictly A bit behind tonight, but Tess speaking to Rhys in that condescending manner was awful #strictly TESS. STOP TALKING TO GROWN MEN AND WOMEN LIKE THEY’RE LITTLE CHILDREN FFS. SO CONDESCENDING 😡😡😡 #Strictly2021 #Strictly #StrictlyComeDancing However, during an appearance on Lorraine on Wednesday, Rhys insisted he had no problem with what Tess had said.  “No one had seen me like that, and I think Tess wanted to really be a comfort to me in that moment,” he told Lorraine Kelly. “And I think some people, they might have read it wrong. “But I totally knew where Tess was coming from, and I totally appreciated that. I love gentleness, so for me it was no problem.” Last weekend, Rhys and Nancy avoided being eliminated from the competition after landing in the dance-off alongside Tilly Ramsay and Nikita Kuzmin.  They will now battle for a place in the semi-final as they hope to impress with an Argentine Tango to In The Air Tonight by Phil Collins on Saturday.  Earlier this week, fellow Strictly star Dan Walker brushed off criticism from viewers after managing to last another week without landing in the dance-off. The BBC Breakfast presenter is by far the lowest-scoring celebrity left in this year’s Strictly, but he and his professional partner Nadiya Bychkova have landed enough support from the public to have avoided being in the bottom two every single week.  He tweeted: “Thank you to everyone who is sending lovely messages and enjoying us having fun on Strictly... and to the few who say… ‘Just leave’, ‘Aren’t you ashamed?’, ‘You’re a disgrace’, ‘It’s a fix’ (which I don’t get) or ‘Who is voting for them?’... IT’S A TV SHOW!” Strictly Come Dancing continues on Saturday at 6.40pm on BBC One. Lorraine airs weekdays at 9am on ITV.  Entertainment Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/john-whaite-strictly-come-dancing-injury-hip-quarter-final_uk_61a774dfe4b0451e550f2e83": "The Great British Bake Off winner was made to rest after his hips were left in “so much pain” during rehearsals for his and pro partner Johannes Radebe’s Salsa routine.  On Tuesday, John revealed on Instagram that he was on his way home after a session with the physiotherapist.  “Going home to rest,” he wrote. ”My hip flexors are in so much pain and the physio has recommended a day of rest. “I’ll watch Christmas films all day and eat Haribo.” John had been suffering with his hips last week ahead of his Argentine Tango, which topped Saturday’s leaderboard.  Sharing a photo on Instagram, John wrote: “This gal Jen Nash performed so much physio on me over the weekend because all those lunges and lifting Jo has knackered my hips. Thank you Jen!” This weekend will see John and Johannes dancing the Salsa to Sister Sledge’s We Are Family.  The five remaining couples are all vying for a place in the semi-final, following Tilly Ramsay’s exit from the competition on Sunday.  Earlier this week, John hit back at social media “trolls” sending abuse to members of this year’s cast. Writing on his Instagram story, John said: “If you’re trolling any of my Strictly pals (or anyone on the planet for that matter) let me ask you… what have you done today to be vulnerable? What have you done today that is inspiring? What have you done today to push yourself out of your comfort zone. “If the answer is ‘nothing’ then pipe down.” He added: “Don’t judge a person before you’ve walked a mile in their (dance) shoes.” Strictly Come Dancing continues on Saturday at 6.40pm on BBC One.  Entertainment Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/george-freeman-cancelled-work-christmas-party-omicron_uk_61a87f26e4b0451e55111e93": "Science minister George Freeman said he and his staff would instead be marking the festive season via Zoom. The minister’s comments appeared at odds with Boris Johnson who has insisted he does not want Christmas events cancelled. Meanwhile, health secretary Sajid Javid recommended people took covid tests before partying.  It also follows a split between the government and scientific advisers over socialising. Earlier this week Jenny Harries, head of the UK Health Security Agency, said people should try to reduce their social contacts. Last night work and pensions secretary Therese Coffey advised people to avoid “snogging under the mistletoe” this Christmas. Asked his thoughts, Freeman told LBC: “I haven’t been kissed under the mistletoe for years.” He added: “We’re trying not to tell everyone who they should kiss or where they should go. “I think Therese Coffey was making the point that we’re all going to have to exercise some common sense and I think the British public know that, in the end, it is up to all of us. 'I haven't been kissed under the mistletoe for years.'Science Minister George Freeman tells LBC the government is 'trying not to tell everyone who they should kiss or where.'@NickFerrariLBC pic.twitter.com/v4YtFWSS2F “If we can prevent the virus from spreading, we’ll all be able to enjoy more freedoms and that’s why we have taken the steps we have. “I can tell you that my parliamentary team and I normally have a Christmas party. “We’ve decided this year that it is probably sensible to do it by Zoom and wait for the spring. It won’t be the best party in the world. “But we don’t want to be telling every individual business what they should or shouldn’t be doing. It is a matter for them.” Asked earlier in the week what he would say to schools scaling back nativity plays and people dropping out of Christmas social events, the prime minister said: “We don’t want people to cancel such events. “We think that overwhelmingly the best thing for kids is to be in school, as I’ve said many times throughout this pandemic.” Deputy Political Editor of HuffPost UK.", "https://www.huffingtonpost.co.uk/entry/not-true-george-freeman-kay-burley-sky-news_uk_61a86fbee4b0ae9a42b7ef9c": "Science minister George Freeman faced a grilling by the Sky News presenter over when different age groups would get the covid booster jab.  By the end of the exchange an exasperated Burley told him: “You don’t know the answer.” It comes after the government announced at the start of the week that every eligible adult will be offered a booster by the end of the January, with the NHS working down the age cohorts five years at a time. When first asked where the plan for the roll out was, Freeman told Burley we were in a global race to defeat the pandemic.  Unhappy with his response, Burley pressed him for an answer and he said the UK was setting the benchmark with its vaccine roll out which meant we did not have to impose the “draconian” regulations. Burley applied the thumb screws: “On Monday, we were promised a plan. It’s Thursday. We haven’t got a plan. People don’t know when they can have their boosters - where’s the plan?” Freeman insisted the NHS had a plan that was being rolled out, adding: “People can apply now, I’ve just had my text last night.” The minister said people around the country were able to get their boosters, before Burley asked him when those in their 20s and 30s would be able to book their jab. Freeman advised people to contact their GP - saying there were slight differences around the country, adding: “If people contact their GP now and go on the app, they can book to get their booster jab and or their second jab.” But Burley hit back: “Minister that’s not true. You can’t get your booster at the moment if you’re in your 20s. “The question is: We were told earlier on in the week that there’s a plan. I’m just asking you where the plan is and when people in their 20s and 30s can book their booster?” Freeman said he did not have at his “fingertips” exactly which GP practices were making it available today, but said the NHS was “flat out” accelerating the rollout. An impatient Burley replied: “Minister we only have a limited amount of time. The answer is you don’t know the answer…” Freeman replied: “No, no, no, that’s not true Kay, the answer is the NHS is doing a brilliant job.” Burley hit back: “Minister, if you’re in your 20s, you don’t know when you can have the jab. Just admit to that because that is fundamentally the case, isn’t it?” Freeman replied: “The case is the NHS is rolling out the vaccine programme and if you contact your GP and book it, you will get your your your jab.” Burley moved on, before quipping: “That’s not true. It’s just not true.” It comes as the government rushed through a deal for more than 100 million extra doses that can be tailored against variants. Health secretary Sajid Javid has agreed to buy enough extra doses to repeat the entire vaccination programme to date as he promised to “future proof” the NHS jabs drive. Deputy Political Editor of HuffPost UK.", "https://www.huffingtonpost.co.uk/entry/omicron-coronavirus-us_uk_61a7d6afe4b0451e55105620": "The unidentified individual was a traveler who returned from South Africa to the US on November 22. The case was confirmed by the California and San Francisco departments of public health, according to the CDC. “The individual, who was fully vaccinated and had mild symptoms that are improving, is self-quarantining and has been since testing positive. All close contacts have been contacted and have tested negative,” the CDC said in a statement. The traveller, who is a San Francisco resident, developed Covid-19 symptoms on November 25 and got tested on November 28, revealing a positive test result the following day, California Governor Gavin Newsom said at a press conference on Wednesday. “We are not surprised by this. This was predictable. This was predicted,” he said. At a White House press conference immediately following news of the variant’s confirmed arrival in the US, Dr Anthony Fauci said he did not believe that the traveller had received a booster shot. He advised Americans to get vaccinated and to get booster shots to help prevent the virus’s spread and serious disease. He also encouraged people to continue practicing virus mitigation measures, including wearing masks. “Just do all of the things that we’ve been talking about up to now. For those who haven’t been doing that, start doing that. For those who have been, continue doing that,” said Fauci, who is the chief medical adviser to President Joe Biden. “Let’s utilize and implement the tools that we have. Because if we had done that, if we had the overwhelming majority of people in this country vaccinated and those who needed to be boosted boosted, our vulnerability would be much less than it is now.” #Parents: Everyone ages 5 years and older is now eligible for #COVID19 vaccination. Help protect your family by vaccinating everyone who’s eligible as soon as you can. More: https://t.co/oV6NgGGUSb. pic.twitter.com/0feK6lPksg Fauci said he was not aware of the CDC investigating any other potential omicron cases in the US The World Health Organisation has described omicron, which was first identified by researchers in South Africa, as a “variant of concern.” There is much that is still not known about this form of the virus, including whether it’s more transmissible than other variants, whether it’s more likely to cause serious illness, and whether it’s better able to evade immune protection. Francis Collins, the director of the National Institutes of Health, said Sunday that it would likely take two to three weeks for scientists to find answers. On Friday, the White House announced that it would prohibit travelers arriving from several southern African nations, even as a growing number of countries in other parts of the world, including Canada and the United Kingdom, confirmed cases. Fauci said on Wednesday that White House health officials had “struggled” with implementing the travel ban, but he reasoned that it was a temporary way to buy time to prepare for the variant’s arrival. “I do hope that this gets sorted out and lifted before it has any significant impact,” he said to a reporter inquiring on behalf of Zimbabwe. General Assignment Reporter, HuffPost", "https://www.huffingtonpost.co.uk/entry/safe-christmas-omicron-variant-booster_uk_61a73f21e4b07fe20120691d": "The government has made it clear that older age groups and vulnerable people will have priority. It also takes around two weeks for the additional dose to have any effect against Covid, and the extended rollout scheme is not yet to be operational. Despite this, Downing Street has avoided telling the public to cancel or downscale their Christmas plans. So what can you do to stay safe during the festive period when you might be mixing with more friends and family? Downing Street’s new Covid restrictions came in on Tuesday and made mask-wearing mandatory in shops and on public transport in England. If you refuse to wear a mask in an area where it is legally required, you could be fined up to £200 unless you’re exempt. While the government’s new rules mean you don’t have to cover your nose and mouth in all public areas, wearing a mask is known to be the single most effective measure for reducing your Covid risk so it is worth covering your face in any enclosed settings. As the World Health Organisation (WHO) website explains: “Make wearing a mask a normal part of being around other people. The appropriate use, storage and cleaning or disposal of masks are essential to make them as effective as possible.” Health secretary Sajid Javid has urged people to take a lateral flow test before attending their Christmas parties this year, even if you don’t have any symptoms. He said this should be part of the “sensible precautions that everyone can take” to ensure Christmas can still go ahead. If you do have symptoms, it’s important to get a PCR test as soon as possible. The government has not recommended people cancel their social plans just yet. Javid said: “I think that we can go ahead with whatever we planned for Christmas, I think that’s absolutely fine.” But he added, “it’s just a sensible time for everyone” to “take whatever sort of cautious measures they can”. The head of the UK Health Security Agency Dr Jenny Harries went further during an interview with BBC Radio 4 on Tuesday as she urged the public, “don’t socialise unless you need to”. This caused a brief row with Downing Street who later overruled her claim. Either way, the most Covid-safe way to socialise with smaller groups and to meet up with people outdoors, so that the virus’ particles are not trapped in an enclosed space. The official advice to wash your hands for at least 20 seconds, and more often, has been in place since the beginning of the pandemic. It’s particularly important to wash them before and after going on public transport. If this isn’t possible, use hand sanitiser. The booster programme will soon be rolled out to everyone aged 18 and over. While it is unclear how much impact the current vaccines will have against the Omicron variant, the jab is one of our best defences against Covid. Vaccine developers working with Oxford University and BioNTech have said the existing jabs would still reduce the severity of Covid, but Moderna’s CEO Stephane Bancel said: “There is no world, I think where [the effectiveness of the current jabs] is the same level.” However, the WHO maintains that all of these predictions are “premature”. The Delta variant is also still the most dominant strain around the world and it is important to be protected against it especially as the the efficacy of the first and second vaccine doses does wane over time. From November 30, double-vaccinated people entering the UK must take a PCR test by the end of the second day after their arrival. They must also self-isolate until they receive a negative test. Unvaccinated people need to take a test 72 hours before returning to the UK and then take a PCR test on the second and eighth day of their return. They must self-isolate for a full 10 days too. England is the only country in the UK which does not have official advice to work from home where possible. Javid told the BBC that he did not think this measure is “necessary” and that the government has already set out new “appropriate, responsible things to do”. Yet, the government’s advisory committee, SAGE, has told ministers that working from home is likely to have the greatest impact on reducing the virus’ transmission. While getting the annual flu jab does not reduce your risk of catching Covid, it can stop you from catching the flu and the deadly virus at the same time. Having both at once would seriously weaken your body’s immune response and make you more susceptible to suffering from severe Covid symptoms. Senior Trends Reporter, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/boris-johnson-downing-street-followed-covid-rules-christmas-parties-sajid-javid_uk_61a72dbae4b0451e550e86f4": "The health secretary did not deny that the parties took place, but he said he was “not aware” of any and he did not attend them. And he insisted that if any festive gatherings had gone ahead, then “all the rules would have been followed”. The prime minister is under fire after the Daily Mirror reported that he broke social distancing rules by attending a number of parties with Downing Street staff in the run-up to Christmas. Johnson is accused of attending a leaving do for an aide on 27 November last year while the second lockdown was in force.  His staff are then alleged to have held their own festive party in Downing Street on 18 December, which Johnson did not attend. It came just days before Christmas when London was in tier 3 restrictions and people were banned from mixing with anyone outside of their household bubble. In response, Downing Street did not deny the claims, but a spokesman told the Mirror: “Covid rules have been followed at all times.” Asked by LBC whether he believed the prime minister and Downing Street staff had broken the rules, Javid replied: “I didn’t attend, I don’t know who attended these parties, but I don’t even think there were parties that I’m aware of. “But the point is, whether it’s in Number 10 or any government department, all rules would have been followed at all times. “I don’t think there’s anything there.” The health secretary also questioned the accuracy of the report, saying: “Well, first of all, it is the Daily Mirror.” Ferrari hit back: “I’m sure they have their facts straight, secretary of state.” According to the Mirror, around “40 or 50” people were crammed “cheek by jowl” into a medium-sized room in Number 10 for the two events. A source told the newspaper: “It was a Covid nightmare”. Last November the country went into its second national lockdown as covid rates began to soar once again. Everyone was told to stay at home while non-essential shops were closed and pubs and restaurants were open only for takeaway and delivery services. Then in December, London went into tier 2 restrictions which prohibited households from mixing indoors, before even harsher tier 3 measures were introduced. The claims come amid mixed messaging over how people should behave this Christmas now that the omicron variant has reached the UK, with a confirmed 22 cases. Ministers have been keen to stress that people should continue with their Christmas plans as normal, with the prime minister telling a press conference yesterday that people should enjoy their parties and nativity plays. However, scientists have taken a different view. Dr Jenny Harries, chief executive of the UK Health Security Agency, urged people not to socialise if they do not need to in the run-up to Christmas. Asked by LBC whether Johnson or Harries was right, Javid responded: “There’s no need to change our plans. “Follow the guidance that’s already there.” ", "https://www.huffingtonpost.co.uk/entry/sajid-javid-go-to-christmas-party-but-take-covid-test-beforehand_uk_61a71bdee4b07fe2012024aa": "Javid echoed comments from Boris Johnson that people should still party for the festive season, but said there were “sensible precautions that everyone can take”. Asked by Sky News whether people needed to change their plans over concerns about the omicron variant, Javid replied: “I think people should continue to behave in the way they were planning to behave over Christmas. “I don’t think there is any need to change those plans.” And asked whether people should take a Covid test before attending Christmas parties, Javid replied: “I would.” His comments come amid a disagreement between politicians and scientists over how people should behave in the run-up to Christmas. On Tuesday, Jenny Harries, the head of the UK Health Security Agency, said people should try to reduce their social contacts in a bid to slow the spread of the new omicron variant, of which there are now 22 confirmed cases in the UK. But Javid insisted that the measures the government had already introduced, such as as mask-wearing in some public places and on public transport, were “the right ones”. “I think that we can go ahead with whatever we planned for Christmas, I think that’s absolutely fine. “But what I will add to that is that we have always said even before this variant came along, that as we get into the colder, darker days of winter, covid likes that and that the flu virus likes that. “So..it’s just a sensible time for everyone just to remember that and and take whatever sort of cautious measures that they can.” As well as bringing in a raft of measures to buy time against the virus, the government has also announced a massive expansion of the booster programme by expanding it to all adults. The government yesterday announced that 23million people will be able to get their third shot by the end of January, while the wait between the second and third jab has been slashed from six months to three. Javid admitted that the target would be a “huge ask” but that he was confident the NHS could cope. “It is a huge ask. It’s something I do believe that people who work in the NHS, all the volunteers, are up to it,” he told Sky News. “But it is a huge ask and that is why I am calling it a national mission. “This has become, from a health point of view, the most important thing we can do to protect ourselves, protect the progress that we have made.” The latest restrictions in England are due to be reviewed in three weeks but Javid said more should be known about the omicron variant before then. “We are confident that actually maybe within two weeks we will know a lot more about this. We may not even need to wait three weeks,” he said. ", "https://www.huffingtonpost.co.uk/entry/england-is-the-only-uk-nation-not-being-advised-to-work-from-home-why_uk_61a62b27e4b0f398af1817ba": "To that end, the Scottish government, the Welsh, and Northern Irish ministers have all advised people to work from home if they can. However, England remains the only UK nation to not give the same advice to English nationals. In Tuesday’s press conference, Boris Johnson insisted working from home is “not currently necessary”. “We have a package in place to deal with the Delta variant, and that’s principally been rolling out the vaccine and it’s been working,” he said. Health secretary Sajid Javid also backed the comments, adding that it’s ministers’ jobs to decide what happens. “I don’t think [WFH] is necessary,” he told BBC’s Andrew Marr. “Because this is about taking proportionate action against the risks that we face. I think what we have set out yesterday and a couple of days before that on the red listing – these are the appropriate, responsible things to do.” The health secretary added that ministers will decide the next course of action, not Sage members who advise the government. However, Sage has said WFH is likely to have the greatest individual impact on the transmission of the virus .  So what will the impact of this be, and is this something we’ll regret later? Dr Simon Clarke, associate professor in cellular microbiology at the University of Reading, says WFH would be hugely helpful in containing the spread of the strain. He tells HuffPost UK: “Getting people to work from home really does cut down on transmission of a virus, so it’s already been identified as one of the major things that could have a major effect. [But] the government has decided that it doesn’t, yet at least, want to go down that route.” Dr Clarke adds that while the transmission of a variant like Omicron is low at the moment, that could change the longer we go without protective measures. So why is the government holding off on WFH advice? Dr Clarke adds: “There’s been a lot of lobbying from people with business interests to stop people working from home. We’ve seen ridiculous things from MPs, suggesting that people should be fired for working from home. “And ordinarily, MPs would never dream of telling businesses how to run their staff but with this, they seem to think it’s okay. And this is all because they believe that it’s damaging other businesses. And frankly, it should be business’s’ decisions, not some MPs with an eye on their donors.” “Yes,” says Dr Clarke. “The implication of this decision is that we won’t drive down transmissions as much, which might not be Omicron right now, but it is other variants such as Delta. It also means we’re not reducing the risk of further hospitalisations.” With people looking to the government more than ever before on how to proceed, now certainly isn’t the time for mixed messages. If it’s possible to get the job done while working from home – as seen during lockdowns and elsewhere in the UK – then perhaps it’s time the government officially recommended it here.  Life Reporter", "https://www.huffingtonpost.co.uk/entry/boris-johnson-double-jabbed-booster-january_uk_61a6327ce4b0ae9a42b3b928": "The government is dramatically ramping up its vaccination programme and reintroducing covid measures over concerns about the omicron variant.  Johnson confirmed the government was deploying the army to help the NHS as he vowed to get boosters in arms. All adults will be offered a booster three months after their second dose, working down the age cohorts five years at a time. But the prime minister also tried to strike a positive tone today, saying temporary vaccination centres will be “popping up like Christmas trees”. It comes after a split emerged between the government and a scientific adviser over socialising.  “The target that we’ve set ourselves is to offer a booster to everyone eligible by the end of January,” Johnson told a Downing Street press conference. “As with the first jabs, we will be working through people by age group going down in five-year bands, because it is vital that the older and the more clinically vulnerable get that added protection first. “So, even if you have had your second jab over three months ago and you are now eligible, please don’t try and book until the NHS says it is your turn.” Booster jabs have been extended to 18 to 39-year-olds with the waiting time between second and third doses halved to three months. However, the PM urged people to wait to be contacted by the health service before booking their booster, adding: “Even if you have had your second jab over three months ago and you are now eligible, please don’t try and book until the NHS says it is your turn.” NHS England chief executive Amanda Pritchard said staff were working at “breakneck speed” to expand the vaccine programme, which was already at its “most complex phase”. A total of 22 cases of the new omicron variant have so far been confirmed in the UK. Deputy Political Editor of HuffPost UK.", "https://www.huffingtonpost.co.uk/entry/omicron-no10-knocks-back-jenny-harries-socialising_uk_61a61783e4b025be1aee9ea3": "The prime minister’s official spokesman said people should abide by official guidance after Dr Jenny Harries suggested people could limit their social contacts to curb the spread of the new covid variant. Harries, the chief executive of the UK Health Security Agency, also said working from home would be a “good thing to do” if cases of omicron to surge. Asked if her view on people avoiding socialising over the Christmas period was shared by the prime minister, his spokesman said: “No. Our advice to the public is as set out at the weekend. “We have put advice out on face coverings and on inward travellers and those who are identified as having the Omicron variant of coronavirus. Beyond that we haven’t set out any further guidance to the public.” Asked if people should follow the PM or Harries’ advice, the spokesman said: “The public should follow the guidance as set out by the government and indeed the prime minister at the weekend.” Harries told BBC Radio 4′s Today programme that even if the current vaccines proved to be effective against the new variant, if it is highly transmissible then it could still have a “significant impact” on hospitals. And she said that people’s “behaviours” around winter and Christmas, when there is more socialising, “need to be taken into account”. “We’ve seen that not everybody has gone back to work and I’d like to think of it more in a general way, which is if we all decrease our social contacts a little bit, actually that helps to keep the variant at bay,” she said. “So I think being careful, not socialising when we don’t particularly need to and particularly going and getting those booster jobs which, of course, people will now be able to have at a three-month interval from their primary course.” Fourteen cases of the omicron variant have now been detected in the UK, prompting ministers to introduce a raft of new measures in England such as mask-wearing in some public places and on public transport. However, the government has so far resisted introducing stricter guidance such as home working, and have also signalled that Christmas is “on track” — demonstrating the difference of opinion between scientists and politicians. This is a breaking news story and will be updated. Follow HuffPost UK on Twitter, Facebook and Instagram. Deputy Political Editor of HuffPost UK.", "https://www.huffingtonpost.co.uk/entry/covid-rules-mask-wearing-where-omicron-variant_uk_61a5fe78e4b07fe2011e088c": "Although there are only 14 confirmed cases of this new strain in the UK so far, this number is expected to rise in the upcoming days. Prime minister Boris Johnson announced on Saturday that rules around mask-wearing have been brought back to “buy time” for scientists to understand the new variant. These “temporary and precautionary” measures will be reviewed in three weeks. This does not mean people have to cover their noses and mouths in all public settings though – so where do you now have to wear a mask? Retail areas: Shopping centres Galleries Post offices Banks Building societies High street solicitors and accountants Auction houses and retail galleries Savings clubs and money service businesses Estate agents Personal care and beauty premises Pharmacies Vets Short-term loan providers Credit unions Shops and supermarkets Food and drink takeaways Public transport: Airplanes Trains Trams Buses Coaches Taxis Private hire vehicles Transport hubs Driving lessons and tests, including for HGV drivers Pupils in year 7 and above, plus all staff members, are being “strongly advised” to wear face masks in communal areas outside the classroom in schools, but this is not yet mandatory.  Restaurants Pubs Bars Theatres Cinemas Hospitality venues Although masks aren’t legally required in the latter settings, we know that wearing a face mask is the single biggest thing you can do to stop the spread of coronavirus, so you might want to consider masking up regardless. If you refuse to wear a mask in a mandatory setting, you risk a fine of up to £200.  Of course, some people are exempt from wearing masks, including children under the age of 11, those who cannot put on, wear or remove a covering because of physical or mental illness or impairment or disability, and those for whom it will cause severe distress. People who rely on lip reading or facial expressions to communicate are also exempt, as well as police officers and other emergency workers. Senior Trends Reporter, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/artillery-shell-rectum-bum-squad-twitter-reaction_uk_61aa265fe4b0f398af204204": "The man – who understandably remains nameless in reports – told staff at Gloucestershire Royal Hospital that he is a military collector. He said he had accidentally fallen on an explosive device dating back to World War 2 when he was having a clear out of his memorabilia. A bum squad – sorry, bomb squad – then arrived at A&E, sent by the ministry of defence who had been contacted by the local police. The officials were told that the 57mm device had already been removed and was not live. The hospital said it followed “relevant safety protocols” and that staff, patients, and visitors were not at risk. A source told The Sun: “It was basically an inert lump of metal, so there was no risk to life – at least not to anyone else’s.” Twitter definitely had a whole lot of fun with the story. Imagine the waddle of shame out of the hospital after this. https://t.co/VfizrDMLoa Rectum? Damn near killed him... https://t.co/8XodjA6lNu How it started vs how it’s going, the rectum bomb edition. pic.twitter.com/Rhck0em30Y ‘Rectum’ is trending and you know what? I’m not even going to look. I can’t be arsed to find out why. How does the NHS pay for this? Shell out.  https://t.co/h8wN9BNvhJ Should this read \"Bum Disposal\"? Bomb squad called after man gets explosive stuck 'in rectum' https://t.co/rxugGuKtoo Me: “why is rectum trending?”Me finding out: https://t.co/27DvSejhkt pic.twitter.com/zLsrQ6x4TV Dials 999'Hello, operator, this is an emergency, can you put me through to the Bum Squad, please?' https://t.co/xLwWPEkVr2 Downing Street insists, “All the rules were followed.” https://t.co/dHJP591a8g \"When tidying the ordnance I tripped and fell, lodging the shell in my rectum\" pic.twitter.com/4oF63i5eCl I suppose on balance, if you did turn up at A&E with an unexploded WW2 shell lodged in your rectum, \"I tripped and fell on it\" is about as good an explanation it's going to get.https://t.co/dcy8qhexgL I want this man and 'second world war explosive rectum man' to get their own show https://t.co/3HUja9kvfB Talk about weapons of ass destruction! #rectum pic.twitter.com/KvKJ86WlVK \"Terry, whatever you do... don't fart...\"Bomb squad called after man gets explosive stuck 'in rectum' https://t.co/C4lcEFq56c Senior Trends Reporter, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/christmas-tree-trafalgar-square-norway_uk_61a89cbce4b0ae9a42b85fef": "The tree is an annual gift from Norway and usually becomes the centrepiece in London’s popular tourist destination when it’s being decorated. This time, it’s causing a stir because it seems to be missing rather a lot of pine needles on one side, prompting people to ask: “Where’s the rest of it?” The 25-metre pine is a present from Norway, shipped from a forest near Olso as a thank you for the UK’s support during World War 2. It’s been a tradition ever since 1947 and is now an integral part of London’s Christmas preparations. Norway even holds a ceremony in November when the selected tree is felled alongside the Lord Mayor of Westminster, the UK’s ambassador to Norway and the Oslo Mayor. It then takes two weeks for the tree to reach the UK. It’s particularly important this year because Trafalgar Square will be hosting its New Year celebration for the first time even instead of fireworks on the Thames, and the lighting ceremony for the tree will begin on Thursday at 6pm. But, Twitter wasn’t exactly impressed with the first few glimpses of the tree this year. the results of the £300 epilator you bought https://t.co/CwfRBRAQ1Y Interflora clearly forgot to include the little sachet of plant feed. Looks like they just got last years back out the rubbish https://t.co/Ld0KT6Jbfd Oh dear https://t.co/HFzmuyst6u Bestie has seen some things and doing her damndest best to see the year out without falling apart. https://t.co/kl85xbuaGd https://t.co/LW0zPeMB45 pic.twitter.com/4kdgbZbZzo Siri: Show me the Christmas tree this country currently deserves. https://t.co/vAq7XZsKSf this Christmas (in the uk) in a nutshell lmao https://t.co/axsEhKxBJN If 2021 was a Christmas tree 😭 https://t.co/DhYQq1OzZA Norway with the king move of disrespecting the UK 👑 https://t.co/pBc3ysZZ7a Either Norway really hates us now, or the global timber shortage is worse than we feared. https://t.co/zWh4ak309i Senior Trends Reporter, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/omicron-transmission-symptoms-mild-severe_uk_61a7acd9e4b025be1af1dc31": "Speaking at a news conference on Wednesday in Geneva, Maria Van Kerkhove, the Covid-19 technical lead in the World Health Organisation’s (WHO) health emergencies programme, said there was “some suggestion” that the variant is more transmissible, but more research was needed. “We expect to have more information on transmission within days, not necessarily within weeks,” she said. The timeline is quicker than the “weeks” WHO had predicted last week that it would take to assess the data. Van Kerkhove added it was “early days” on making an assessment on the severity of the variant. On Wednesday, a number of media reported an official at WHO saying early indications suggest most Omicron coronavirus cases are “mild”, and that there is no evidence to suggest the efficacy of vaccines has been reduced by the new strain. The media reports pointed to the news agency Reuters quoting an anonymous WHO official. At the briefing, Van Kerkhove said: “We have seen reports of cases of Omicron that go from mild disease all the way to severe disease. There is some indication some of the patients are presenting with mild disease ... but again, it’s early days.” Van Kerkhove added reports of more hospitalisations in South Africa could be because there is more cases of Covid more widely. Scientists have said they are concerned about the Omicron variant – also known as B.1.1.529 – as it has about 30 different mutations, double the number of the Delta variant. It has now been detected in 23 countries, WHO confirmed. At the weekend, the South African doctor who was one of the first to suspect a different coronavirus strain among patients suggested patients at her clinic had symptoms different from the dominant Delta variant, albeit “very mild”.  Dr Angelique Coetzee, a private practitioner and chair of South African Medical Association, said: ”Most of them are seeing very, very mild symptoms and none of them so far have admitted patients to surgeries. We have been able to treat these patients conservatively at home.” Coetzee, who is also on the Ministerial Advisory Committee on Vaccines, said unlike the Delta so far patients have not reported loss of smell or taste and there has been no major drop in oxygen levels with the new variant. Her experience so far has been that the variant is affecting people who are 40 or younger. Almost half of the patients with Omicron symptoms that she treated were not vaccinated. She saidL “The most predominant clinical complaint is severe fatigue for one or two days. With them, the headache and the body aches and pain.” But other medics have warned against the burgeoning “mild” narrative. Dear MediaPlease stop repeating anecdotes that physicians have seen mild cases of OmicronThe VAST majority of COVID cases of all variants are mild. The problem is a fraction are not, and when cases pile up, the fraction adds to a lot of hospitalization, death, and long-COVID If, among relatively small N of Omicron cases detected, physicians were seeing a lot of severe disease & death, that would be exceptional and scaryLack of severe disease among a small number is on par w others. There is no reason to believe Omicron has become less virulent There is also no reason to believe it has become more virulent. On other hand, There is very good reason to believe it is more able to evade previously acquired immunity. It may be as or more transmissible as Delta, esp in context of population immunity.3/ Only about 2-4% of confirmed covid cases are hospitalised - lower for younger populations. Given \"mild\" is short for \"not needing hospital\", majority of ANY covid variant cases are mild. Problem is that 2-4% of tens of thousands of cases day after day overwhelms health systems. https://t.co/ZQHysdeRQy On Wednesday, Prof Neil Ferguson, head of the disease outbreak analysis and modelling group at Imperial College London, said people should not assume that Covid will evolve to become a milder disease, adding that the threat posed by the Omicron coronavirus variant will not be clear until the end of December.  He told MPs that while evolution would drive Covid to spread more easily, the virus might not become less dangerous.  “Most of the transmission has already happened by the time people get hospitalised,” Ferguson told the Commons science and technology committee. “The virus cares about replicating very fast within the respiratory tract and getting out into the environment. If that happens to kill somebody 10 days later the virus really doesn’t care.” News Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/barbados-officially-declares-rihanna-a-national-hero_uk_61a6a183e4b0451e550debdc": "Barbadian Prime Minister Mia Mottley awarded the singer, beauty mogul and philanthropist with the honor of National Hero of Barbados during an overnight ceremony on Monday night where the country was declared a republic for the first time. “On behalf of a grateful nation, but an even prouder people, we therefore present to you the designee for National Hero of Barbados, Ambassador Robyn Rihanna Fenty,” Mottley said at the event, held in Bridgetown, the nation’s capital. The prime minister then referenced Rihanna’s 2012 song “Diamonds”, telling the singer: “May you continue to shine like a diamond, and bring honor to your nation, by your words, by your actions and to do credit wherever you shall go.” Rihanna, whose full name is Robyn Rihanna Fenty, was born in the St Michael parish in Barbados. Over the years, the country has celebrated and recognized the extraordinary influence and philanthropy of the nine-time Grammy Award winner. In 2018, Rihanna was appointed as Ambassador Extraordinary and Plenipotentiary for Barbados. Ten years prior to that, she’d been appointed as one of the country’s cultural ambassadors. Rihanna in 2012 founded the Clara Lionel Foundation, which supports and funds education, health and emergency response programs around the world. She received Harvard University’s humanitarian of the year award in 2017. Harvard recognised her at the time for funding the “construction of a state-of-the-art center for oncology and nuclear medicine to diagnose and treat breast cancer at the Queen Elizabeth Hospital in Bridgetown”. Monday’s overnight ceremony in Bridgetown marked Barbados’ new status as a republic, concurrent with its 55th Independence Day on November 30. The country officially removed the UK’s Queen Elizabeth as its head of state, though it remains part of the Commonwealth. Governor General Sandra Mason, who was elected the first president of Barbados last month, was sworn in early Tuesday. Rihanna addressed an audience later on Tuesday, as seen in a video clip posted to Twitter. “I’m so proud to be a Bajan. I’m going to be a Bajan ’til the day I die,” she said during her speech. “This is still the only place I’ve ever called home. I love Barbados. I love you guys.”  She also addressed Mottley, who was seated in the crowd: “Thank you so much for honoring me in this way. I have traveled the world and received several awards and recognitions ― but nothing, nothing compares to being recognized in the soil that you grew in.” Trends Reporter, The Huffington Post", "https://www.huffingtonpost.co.uk/entry/maggie-throup-covid-christmas-party-minister-question-time_uk_61aa072ce4b0ae9a42bb7596": "The Mirror broke a story that there was a gathering of around 40 or 50 people on December 18 last year in No.10, while the rest of London was in Tier 3 Covid restrictions – meaning people could not socialise outside their households indoors. Ministers have been trying to address the scrutiny by claiming that all of the Covid rules were followed at the time – but this isn’t quite answering questions over whether the party actually happened. Throup was in the spotlight on Thursday when Question Time audience member asked for clarity over whether the party had actually taken place. She repeated the party line and said: “I have been reassured that all guidance was carefully followed.” The show’s host Fiona Bruce then turned to the audience and asked: “Does that answer your question?” When the crowd replied with a resounding “no”, Bruce asked Throup: “Do you want another go?” “My answer is not going to change because the guidance was followed, as the prime minister quite clearly said,” Throup maintained. While Labour’s shadow minister Thagnam Debbonaire put her head in her hands, the audience groaned. Bruce butted in and said: ”So clearly there was no Christmas party.” The rules stated at the time that people could not have parties with anyone outside of their social bubble. Throup replied: “Whatever the event was, then the guidance was followed.” “So there was an event,” Bruce said. Throup then tried to conclude the topic by saying, “this has just been rumour and hearsay,” but judging by Twitter’s reaction, the subject is far from over. Good lord this is painful  pic.twitter.com/09oStFDWEZ Maybe she’s just never been to a party before and wasn’t sure what one was? https://t.co/K6Hyxt8AK4 pic.twitter.com/AsdJeO2sJe We'll, they've talked themselves into a corner. If guidance was followed, then there was an event - when others couldn't meet in work, at home or elsewhere. pic.twitter.com/3jlGW8fK6j Get the lady a shovel 😂😂😂😂😂😂 https://t.co/pbdbvMraAR Watch the Tory Christmas Shindig go from following the guidance to being an “event” to merely being a rumour in less than a minute pic.twitter.com/S4WniYi8sD This is one of the most embarrassing comments I have seen since… Johnson at the CBI Monday week ago. https://t.co/9aknkq7THE one rule for them, another for the rest of us#Boris #BorisJohnson #Christmas #ChristmasParty #MaggieThroup #QuestionTime #Covid19 #Coronavirus pic.twitter.com/4QPFMAkILa Senior Trends Reporter, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/old-bexley-and-sidcup-by-election_uk_61a96df4e4b0ae9a42ba6804": "The constituency was held by former Cabinet minister James Brokenshire until his death in October, and the Tories cruised to a victory despite a bruising few weeks for Boris Johnson’s administration. Local Tory councillor Louie French won with a majority of 4,47. But this was significantly reduced from 18,592 in 2019 as the party saw a swing of 10.23% to Labour, who finished in second. A tilt of that margin in the prime minister’s Uxbridge and South Ruislip would be enough to oust him, Labour sources said. The full results were: Louie French (Con) 11,189 (51.48%, -13.06%) Daniel Francis (Lab) 6,711 (30.88%, +7.40%) Richard Tice (Reform) 1,432 (6.59%) Jonathan Rooks (Green) 830 (3.82%, +0.62%) Simone Reynolds (Lib Dem) 647 (2.98%, -5.31%) Elaine Cheeseman (Eng Dem) 271 (1.25%) John Poynton (UKIP) 184 (0.85%) Richard Hewison (Rejoin) 151 (0.69%) David Kurten (Heritage) 116 (0.53%) Carol Valinejad (CPA) 108 (0.50%) Mad Mike Young (Loony) 94 (0.43%) The contest took place following damaging headlines over allegations of sleaze, claims that lockdown rules were broken in No 10 and the emergence of the Omicron coronavirus variant. Another big talking point will be a turnout of just 34% – 21,788 votes – which suggests the by-election contest has failed to excite the public, albeit in December when getting the vote out proves difficult. Brokenshire held the south-east London seat with a majority of almost 19,000 at the 2019 general election, taking 64.5% of the vote. Reform leader Richard Tice came in third, claiming his party was now “on the upward march”. The Greens in fourth and Liberal Democrats in fifth both lost their deposits. French used his acceptance speech to pay tribute to his “good friend” Brokenshire, who died from lung cancer. He said: “This has been a tough contest, which has been fought with dignity and respect.” Soon after the result was announced, the spinning operation began in earnest. The Conservatives said French’s victory was “almost unheard of” for a sitting government. Tory deputy chairman Justin Tomlinson said: “We’re absolutely thrilled. For a government to get over 50% of the vote in a parliamentary by-election is almost unheard of, and with a majority of over 20%. “A fantastic local candidate, positive campaign, focused on the tangible difference we’re making to people’s lives, having navigated the unprecedented challenges of Covid.” But the Labour Party sounded an upbeat note despite their loss. As well as the swing, they pointed to their 30.8% share of the vote – the party’s highest share in the seat for 20 years. Ellie Reeves, MP for Lewisham West and Penge, said: “We’re pleased with the result tonight. “This is a Conservative stronghold, somewhere that had a 19,000 majority at the last general election and what we’ve seen tonight is that majority being slashed. There’s been a 10% swing over to Labour this evening. “We’ve been knocking on doors for weeks here and finding many, many Conservative voters that have said actually I’m not going to vote for them this time, I’m going to vote for Labour. “I think it’s clear that we’re winning back the trust of people and it’s a remarkable result for us in a Tory stronghold.” News Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/sajid-javid-snog-family-tradition_uk_61a92fc4e4b07fe20124f9f5": "The Cabinet minister said that “people can snog who they wish” this Christmas – which contradicted a colleague advising against puckering up to stem the spread of coronavirus. Javid told ITV News: “People can snog who they wish. I’ll certainly be kissing my wife under the mistletoe – it’s a Javid family tradition. “It’s got nothing to do with the government who you kiss or anything like that. But the only thing is just – there’s guidance already out there – just be cautious and enjoy yourselves.” 'People can snog who they wish... it's got nothing to do with the government who you kiss'@SajidJavid says people should kiss who they want under the mistletoe this Christmas, adding: 'Be cautious and enjoy yourselves' https://t.co/d0jl6CGRB2 pic.twitter.com/BCsaIuc3Fi It was the latest instance of mixed messaging over how best to behave over Christmas as the Omicron variant surges. On Wednesday, work and pensions secretary Therese Coffey told ITV’s Peston programme that “we should all be trying to enjoy the Christmas ahead of us”. But she said “snogging under the mistletoe” should be avoided with “people you don’t already know”. Also on Thursday, Downing Street told the public not to cancel their Christmas parties – just hours after science minister George Freeman revealed he had cancelled his work Christmas party and they would instead be marking the festive season via Zoom. In another case, head of the UK Health Security Agency Dr Jenny Harries urged people not to socialise “when we don’t particularly need to” on Tuesday. No.10 slapped down Dr Harries’ advice not to socialise where possible by claiming that was not the government’s official advice at the moment.  The latest government minister to say the word “snog” was too much for many. \"kissing my wife is a Javid family tradition\" right I'm dead https://t.co/sEKRLj8RW2 “They’re asking us to define a cautious snog” https://t.co/csdQEnuhTa pic.twitter.com/xby8xb57fb Also, how do you snog cautiously? I am calling for a total and complete shutdown of politicians and journalists saying the word ‘snog’, until our elected representatives can figure out what is going on. Hang on… snogs are back on again? https://t.co/DJHm7obGHC The government has helpfully released a video showing people how to snog cautiously. #idiocracy #COVID19 #ChristmasParty pic.twitter.com/hM8d95HJ5R Labour leader Sir Keir Starmer earlier said: “I don’t think it’s the role of government to dictate who people can kiss or not kiss, and I was quite surprised to see that suggestion come out of government. “I think it just demonstrates how they’re (at) sixes and nines if that’s what they’re now discussing.” News Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/anti-cancel-culture-conference-farage-london_uk_61a9023be4b0f398af1e3caa": "The Spectator reported that Counter Conference, which was set to take place at The O2′s 3,000 capacity Indigo venue next week, had sold just 400 tickets. Organisers said the event was not going ahead because of problems caused by travel restrictions implemented following the emergence of the Omicron variant. The right-wing alternative to Twitter – called GETTR, and run by former Trump aide Jason Miller – is behind the event, which was due to feature Farage, ex-US housing secretary Ben Carson and actor-turned-online personality Laurence Fox. A spokesperson for GETTR said the new rules would make “scheduling travel to the conference impossible for many of the conference’s confirmed speakers and participants.” Organisers said in a statement to the Mirror: “Due to the UK’s newly-mandated travel restrictions, we regret to announce that the Counter Conference event that was to be held on the December 8 at Indigo at The O2 has been cancelled.” News Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/rupauls-drag-race-season-14-how-to-watch-stream-uk-netflix-wow-presents-plus_uk_61a9f0cbe4b07fe2012602ea": "The upcoming 14th series of the original US version will air exclusively on the streaming service WOW Presents Plus when it launches next month.  New episodes will begin streaming from 8 January, and will be available alongside spin-off Untucked from 4am every Saturday.  Recent years have seen all seasons of US Drag Race debut on Netflix here in the UK, while the last two seasons of the All Stars spin-off have followed suit, having previously had a home on Comedy Central and NOW.  WOW Presents Plus serves as the international home of Drag Race, where subscribers can watch all editions, including those from Spain, Holland, Italy and Canada. The UK edition airs on BBC Three here, but international viewers can also keep up to date with the British queens on WOW Presents Plus.  The streaming service, which is from the production company behind the Drag Race franchise, claims to have the biggest and best LGBTQ+ content library in the world, with over 500+ hours of programming, including content from Drag Race alumni and award-winning documentary films. Meanwhile, the queens participating in the 14th season of RuPaul’s Drag Race have been unveiled, who include the franchise’s first-ever cisgender heterosexual male queen.  Get to know them all in the video below... Entertainment Editor, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/george-clooney-turned-down-35-million-dollars-for-one-days-work_uk_61a9fb8ce4b044a1cc21faec": "The Ocean’s Eleven actor said he was offered $35 million (around £26.3 million) to star in an airline commercial but he decided against it after speaking to his wife, human rights lawyer Amal. He told the Guardian: “I was offered 35 million dollars for one day’s work for an airline commercial, but I talked to Amal about it and we decided it’s not worth it. “It was (associated with) a country that, although it’s an ally, is questionable at times, and so I thought ‘Well, if it takes a minute’s sleep away from me, it’s not worth it’.” George, who celebrated his 60th birthday in May, married Amal in 2014 and they have two children, twins Ella and Alexander, born in June 2017. Speaking about childcare, he said they only have a nanny “four days a week”, as “it’s so important to Amal (to be involved)”. He told the newspaper: “And during lockdown it was just us – for a full year! I felt like my mother in 1964 – doing dishes and six loads of laundry a day.” The actor’s latest project saw him directing The Tender Bar, a coming-of-age film based on a book of the same name by JR Moehringer, which tells the story of a boy who seeks father figures at a bar run by his uncle. The movie, released this month, is set in New York and stars Ben Affleck as bar owner Charlie, with Tye Sheridan playiing his nephew J.R. It had its UK premiere in October at the London Film Festival, where Clooney said it had given him a welcome break from the “pretty dark” types of movie he normally works on. “Most of the films I do are pretty dark and this one felt light, and it felt like the world was pretty dark so I wanted to work on something that was a little lighter, you know,” he said. Head of Entertainment, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/alec-baldwin-halyna-hutchins-shooting-abc-interview_uk_61a9f0e7e4b044a1cc21d5ed": "In an emotional interview with ABC – the first in which he gave a full account of the shooting in public – the actor said on Thursday: “This is one in a billion, that someone puts a real bullet in the gun. That never happens. “The idea that a real bullet was in that gun … was not even in a realm of possibility. And that’s the thing they must find out: Who brought bullets onto the set.” The actor was holding an old-fashioned revolver during an 21 October practice scene, called a marking rehearsal, after being told the gun was “cold,” or had no live rounds inside. But the gun suddenly fired, killing cinematographer Halyna Hutchins and wounding director Joel Souza with a live bullet. Baldwin, at times in tears while recounting the shooting, told ABC News’ George Stephanopoulos he had “no idea” how a live bullet made its way to the set of the film, a Western being made near Santa Fe, New Mexico. “I’m holding the gun where she told me to hold it, where it’s meant to be aimed right below her armpit,” Baldwin said during the interview, describing the marking rehearsal with Hutchins. He described the gun’s placement for the camera tests as “a completely incidental shot that might not have even been in the film at all. “I take the gun and I start to cock the gun, I’m not going to pull the trigger,” Baldwin continued. “I let go of the hammer of the gun and the gun goes off.” .@GStephanopoulos presses Alec Baldwin on fatal 'Rust' accident: \"Why did you choose, in your 40 years [in the industry], not to check the gun yourself?\" https://t.co/zYugqKhIVW #BaldwinABC pic.twitter.com/Y9eTITwliE The actor said he thought Hutchins had fainted at first before he heard Souza begin screaming. Police arrived about 15 to 20 minutes later, and Hutchins was taken to the hospital by a helicopter.  “When she finally left, I don’t know how long she was there, they kept saying she’s stable,” Baldwin recounted. “Just because you disbelieve that there was a live round in the gun, you disbelieve that this would be fatal.” Baldwin said he wasn’t told he’d discharged a live round and that Hutchins had been killed until hours later at a police station when officers showed him a “.45-caliber slug” removed from Souza’s arm. The revelation, he said, prompted “the kind of insanity-inducing agony [realising] that somebody put a live bullet in the gun.” Baldwin described Hutchins as a talented cinematographer who was loved and admired by her colleagues. He stressed that the pair injured in the misfire were victims and that he was speaking publicly to discount any misconceptions that spread after the tragedy. “When I talk about this, my concern is that I don’t sound like I’m the victim, because there is a victim: There’s a woman who died, and my friend who got shot,” he said. Investigators are still probing how deadly ammunition made it onto the set. Prop guns or real firearms used in film scenes are typically only loaded with blanks or dummy rounds, and having live rounds on site has been described as a major breach in protocol. Questions have swirled around crew members who were supposed to handle the gun before it was passed to Baldwin, including Seth Kenney, the supplier of the blanks and dummy rounds for the movie, and the armorer for Rust, Hannah Gutierrez-Reed. Gutierrez-Reed told investigators she had loaded the gun with five dummy rounds before a lunch break, but added there was “one round that wouldn’t go in.” She said she added the sixth round after lunch and her attorney has said the armorer had no idea where the live round, including others recovered by investigators after the shooting, came from. Pressed by @GStephanopoulos on the fact that some people say you're never supposed to point a gun at anyone on set, Alec Baldwin says: \"Unless the person is the cinematographer who's directing me at where to point the gun for her camera angle.\"Read more: https://t.co/zYugqKhIVW pic.twitter.com/Nkr4UBYjip Baldwin said he didn’t know who is responsible for the shooting and didn’t believe he would be criminally charged, adding that he hoped investigators would follow their probe “to the ends of the Earth” to determine where the bullet came from. “As far as I’m concerned, someone put a live bullet in a gun,” he said. “A bullet that wasn’t even supposed to be on the property.” Two civil lawsuits have been filed in the aftermath of the shooting that name Baldwin, including one that accuses him of “playing Russian roulette” and failing to check the rounds himself before the scene rehearsal. The actor rejected that criticism, saying he put his trust in the armorer and others who handled the gun and told him it was safe. “I’ve gotten shot and killed in films before … and I trusted them to do their job,” he said. He added later: “I can’t imagine I’d ever do a movie that had a gun in it again.” Senior Reporter, HuffPost", "https://www.huffingtonpost.co.uk/entry/conservative-party-chairman-charlie-stayt-bbc-breakfast-christmas-party_uk_61a9db36e4b0451e5514056a": "Dowden, the Conservative Party chairman, became the latest minister to struggle to answer questions about the alleged party on December 18, 2020 during an interview on BBC Breakfast on Friday. Sources told the Mirror that around 40 or 50 people gathered in No.10 for festivities last year at a time when London was in tier 3 restrictions – meaning people couldn’t meet anyone outside their own support bubble. As he dodged questions repeatedly, Stayt accused Dowden of “withholding information” about the supposed gathering. The BBC Breakfast host asked: “Can you describe that party for us?” Dowden replied: “I was not working in Downing Street at the time, nor do I work in Downing Street now. “What I can tell you is that the prime minister has been very clear that the rules were followed at No.10 Downing Street.” Stayt continued to press the cabinet minister, and said: “Have you had that conversation with anyone that does know [what happened]?” Dowden then diverted the conversation to discussion about the Tory victory in the Old Bexley and Sidcup by-election, along with the new Covid variant, Omicron, and the extended booster programme. Charlie Stayt - On the 18th of December there was a party at No.10... can you describe that party for us?Oliver Dowden - The PM has been very clear that all rules were followed at all timesCharlie Stayt - Why are you withholding information about that party? #BBCBreakfast pic.twitter.com/GuPqyKDfGw ″I have not been having conversations about what may or may not have happened over a year ago, I’m actually focused on getting on with the job and delivering on the big concerns of people,” the Tory chair replied. Stayt then said: ”I think a lot of people think, in the spirit of openness, they would expect you, as chairman of the Conservative Party, to ask the questions we can’t ask. “If you’re not prepared to tell me what you know about that evening, you’re withholding information. It’s not that you don’t know, it’s that you’re withholding it.” “Charlie, I’m not withholding information,” Dowden hit back. “I don’t want to speak for your viewers, but I think I would be interested to know what your viewers are really concerned about.” The BBC Breakfast host replied saying they cared about “really straightforward answers”, while Dowden claimed that he believes the public want him to focus on the pressing issue of the pandemic. “My focus is not on having conversations about what may or may not have happened in Downing Street,” he repeated. Stayt concluded that section of the interview by saying: “People will draw their own conclusions from the way you’ve answered those questions, which is absolutely fair – you’ve said what you want to say.” Senior Trends Reporter, HuffPost UK", "https://www.huffingtonpost.co.uk/entry/foods-that-ease-heartburn-acid-reflu_uk_61a92dd3e4b025be1af53f9d": "To that, we say: more power to you! If there’s ever a time to indulge in delicious food, it’s the festive season. But the combination of richer foods and the volume many of us are consuming means one thing: it’s heartburn and acid reflux season. Wondering what the difference between heartburn and acid reflux is? According to Healthline, acid reflux is a common medical condition that can range in severity from mild to serious, and heartburn is a symptom of acid reflux. While many of us accept heartburn as an unpleasant side effect of the month of December, it doesn’t have to be that way. There’s actually a lot you can do to avoid heartburn in the first place. “Try eating smaller meals instead of three large meals,” suggested Amy Shapiro, a registered dietitian and nutritionist. “When we eat large meals it puts upward pressure on our oesophagus, causing heartburn, and also large meals cause our bodies to produce more stomach acid, which can lead to heartburn.” Eating slowly can help, too. “This will allow you to chew your food, digest more easily and will prevent overeating, since your brain will have time to realise you are full before you eat too much,” Shapiro said. You can also try cutting off the indulgences too close to bedtime. “When you lie down, the food in your stomach presses on your oesophageal sphincter,” Shapiro said. “By not having a lot of food in your stomach, your heartburn will decrease. Try to stop eating three hours before bedtime.” Of course, sometimes the heartburn just hits and there’s not a whole lot you can do about it. When that happens, these foods and drinks can help. High-fibre foods like oatmeal can work wonders when you’re dealing with heartburn. “Oatmeal, brown rice and vegetables, plus foods that are lower in acidity like bananas, cauliflower and nuts, are helpful to offset strong stomach acid,” said Maggie Michalczyk, a registered dietitian. Shapiro added that whole grains are easy to digest and don’t create acid in the body. “Additionally, when simply prepared, they are mild and easy on the GI tract.” “Foods that have a high water content help weaken stomach acid,” noted Michalczyk. If watermelon isn’t your thing, lettuce and cucumbers work, too. While many are opting for full-fat dairy products these days, when you’re dealing with heartburn it’s better to stick with low-fat yogurt or milk, as it can offset stomach acid. “Low-fat yogurt and low-fat milk may help relieve heartburn symptoms as they’re happening,” Michalczyk said. “It’s important that they’re low-fat though, because fat can further aggravate acid reflux.” Ginger is known for working wonders on the digestive system (if you’ve ever had a bout of nausea eased by ginger, you know this to be true), and it can help with heartburn too. “Fresh ginger is a great natural remedy to help with digestion, so keeping ginger tea on hand when heartburn hits is a good idea,” Michalczyk said. Looking for something cooler? Add some fresh ginger to your morning smoothie. Vegetables don’t exactly get a starring role in the month of December. But if you’re dealing with heartburn, veggies might just be your best friend. “Leafy greens, root veggies and even peas are mild, improve digestion and help to prevent GERD [gastroesophageal reflux disease], as long as they are not cooked with lots of garlic or spice,” Shapiro said. “Enjoy in abundance at any holiday meal!” We typically think of aloe vera as that green, slimy substance that helps ease sunburns. But guess what? “Just like it puts out the fire on your skin from a sunburn, aloe vera can soothe reflux or acid indigestion when taken internally,” Shapiro said. “You can blend it or make a smoothie or simply purchase aloe vera juice from your local market to soothe symptoms on the spot.” By adding parsnips to heavier meals, you can increase flavour in your food without increasing fat, meaning it won’t be nearly as heartburn-inducing (but just as, if not more, delicious). “Try to increase the load of fresh produce in your meals, while decreasing the amount of fat,” said Kylene Bogden, a registered dietitian-nutritionist and wellness adviser for Love Wellness. “For example, if you are getting ready to prepare a creamy winter soup, try pureeing cooked parsnips or potatoes for half of the base instead of using the entire amount of heavy cream that the recipe calls for. This is how we increase flavor and nutrient density while decreasing fat. Most importantly, we are helping to stop reflux in its tracks.” Camomile tea can be incredibly soothing when you’re dealing with an upset stomach, said Tracy Lockwood Beckerman, a registered dietitian based in New York City. “The soothing sips and aromas of the camomile help to soften any post-meal acidic burn,” she explained. By throwing some fennel in your dish, you can make your meal less acidic. “Fennel is an excellent alkaline food to help blunt elevated acid levels,” she said. “That way, it may help to balance the high pH of other components of the dish and offset high stomach acid.” On Assignment For HuffPost", "https://www.huffingtonpost.co.uk/entry/best-lip-balms-for-winter-expert-tips_uk_61a780b9e4b0f398af1aac9d": "There’s no escaping the fact that winter has arrived; the weather has become rather cold and the chances are that you’ve already cranked your heating up. It’s this combination of cold weather and hot dry air that can wreak havoc on your lips in winter – and your skin in general.  Having a seasonal skincare routine in place is fairly common, but what about seasonal lip care? For one reason or another, we don’t always consider our lip care when we’re considering our skincare, but this shouldn’t be the case.  In the colder winter months our lips can really suffer. The combination of cold outdoor air and dry, hot air from central heating can leave your lips dry, cracked, chapped and sore – which is where a good quality lip balm comes in.  As Dr Catherine Borysiewicz, consultant dermatologist at the Cadogan Clinic tells HuffPost UK: “If the skin barrier of the lips is disordered it is important to treat the lips to an extra protective layer.”  Damage happens when the keratin in the top layer of the skin begins to lose its elasticity, which then leads to damage in the form of dryness, chapping, and soreness. Lips are more susceptible to damage and soreness than the rest of our face, which is why protecting them with lip balm is important.  Choosing a lip balm isn’t always a simple task as there are so many brands and formulas to choose from. Dr Borysiewicz recommends choosing a product that is quick and easy to apply and that can be carried around in your pocket or bag. She also recommends opting for a lip balm with SPF where possible. “Don’t forget an SPF particularly if you are out all day or exposed to sun especially high altitude environments such as skiing,” she says. “This will help reduce the risk of pre-cancerous sun damage and also reduce cold sore flares.”  Even if you’re not on the slopes, SPF is important, just as it is for your skin. “Common ingredients found in lip balms are: castor oil and hemp seed oil, petroleum jelly, shea butter and cocoa butter, humectants such as honey. Also vitamin E for its antioxidant effects and mineral sunscreen products such as zinc oxide and titanium dioxide,” says Dr Borysiewicz.  When it comes to natural versus synthetic ingredients, Dr Borysiewicz says that each have benefits. “Both work well, so if you generally prefer ‘natural’ ingredients there are plenty of products to choose from,” she says. And while there aren’t any specific ingredients to avoid, Dr Borysiewicz does recommend steering away from overly fragranced products.  “It is important to remember that everyone’s skin is different,” says Dr Borysiewicz said. “One person’s favourite lip balm may not suit another person’s skin, so try out a few until you find your best match.”  If you have an irritation to a balm, your lips will actually become more dry and chapped. “If you notice this happening try switching products,” she says. Need some lip balm recommendations? We’ve got you covered with our roundup of the best lip balms for winter lip care.  Shopping Writer", "https://www.huffingtonpost.co.uk/entry/is-it-possible-to-reverse-grey-hair_uk_61a92aaae4b07fe20124f18d": "As such, there are products designed to stop those grey hairs from happening – some supplements promise to prevent grey hair from coming in in the first place, while other topicals claim to reverse the grey. Even L’Oreal found reason to pursue the subject, announcing in 2011 that an all-natural pill would be out within five years that could prevent grey hair. (A rep from L’Oreal shared that it is no longer a focus area for their research and innovations team). But as that abandoned project might hint at, the reality of preventing and reversing grey hair isn’t as simple as popping a pill – at least not yet. While the mechanisms behind hair colour are complicated, in the simplest terms, grey hair is caused by the loss of pigmentation. As we age, we produce less hair pigmentation, which results in grey hair. For the most part, when exactly this occurs seems to be genetically determined.  But there are some reasons grey hair may sprout sooner. Craig Ziering, board-certified dermatologist and founder of Ziering Medical, says that vitamin deficiencies, specifically of vitamin B6, B12, D, E or biotin, can accelerate the growth of grey hair. Oxidative stress from both internal factors (like an unhealthy diet) and the environment (like UV radiation) might play a role, too. Smoking has a significant effect: “Studies have shown that smokers are two times more likely to start greying before age 30 as non-smokers,” Ziering said. Even hair products – including those used to colour or bleach hair – can include ingredients that decrease the melanin in hair. “Hydrogen peroxide, which is in many hair dyes, is one such harmful chemical. Excessive use of products that bleach hair will also eventually cause it to turn white,” Ziering said. Stress, too, seems to be a factor – think of the oft-mentioned comparison of presidents in their first year versus their last.  Keeping hair from going grey is big business – just take a look at the range of products available claiming to act as a grey hair treatment. But according to the experts we spoke with, the ability to reverse grey hair or prevent age-related colour changes isn’t possible. “While certain nutrient deficits and health conditions may spawn premature grey hairs, it’s impossible to restore your natural hair colour if your greys are genetic or due to natural ageing,” Ziering said. There’s reason to stay hopeful, though, if less grey hair is your goal. While most of what we know about grey hair says that once a hair is grey there is no going back, one study found that reducing stress just might help (easier said than done, right?). Researchers found that in some subjects, previously grey hairs repigmented after subjects went on vacation. The study has its limitations, but it illustrates for the first time that stress – and the reduction of it – actually can impact hair colour. “We can’t fully stop our hairs from going grey,” said Martin Picard, a researcher at Columbia University and author of the study. “This study shows that ageing is malleable ― it is not a fixed, predetermined process we are doomed to experience in the same way no matter what we do. Our behaviour, and perhaps how we learn to see the world and the stress we create for ourselves, seem to influence how our cells age, and when our hairs will eventually go grey.” Besides reducing stress, there are some other tactics that might reduce the development of new greys – but only if lifestyle or nutritional deficiencies are the cause. “Certain vitamins and minerals help ensure that your hair follicles have the maximum nutritional value to perform the metabolic functions in the bulb, one of which is production of the pigments (melanin) that the hair needs to retain its natural colour,” Ziering shared. “Amino acids and proteins that trigger metabolic function in our follicles are beneficial,” he said. With that in mind, eating foods with the aforementioned vitamins can help, as can consuming antioxidants can counteract the effects of oxidative stress, like fresh fruits, green tea, olive oil, and fish. “Eat well, sleep well, work against environmental stressors and avoid smoking,” Ziering suggested. “Use sun protection for hair and scalp. Boost calcium, protein, and B vitamins.” As for those supplements claiming to prevent grey hair, technically they may work if they are making up for nutritional deficiencies, but no more than eating a healthy diet or taking a general multivitamin might. Currently, treatments are being tested that have shown to reverse greying and repigment hair. “These agents include enzymes such as catalase which breaks down hydrogen peroxide, known to accumulate in the dermis of greying hair, so there may be treatment and prevention in the future,” Ziering said. “Looking ahead, this may someday be the foundation of a treatment which will reverse the exhaustion of the pigmentary potential of the melanocytes of hair bulbs,” he said. “Not today and not tomorrow, but in the near future we may potentially unearth a ‘Benjamin Button’ effect resulting in restoration of richer, more youthful hair colour for the 40s, 50s, 60s and beyond,” he added. Picard is continuing to study grey hair as well. “I think we’ll learn more about the influence of the mind on the body. How our human experiences become embedded in our biology – in our hairs,” Picard said. “The mind and body are connected, and this shows us even in hairs!” In the meantime, there is always the option to embrace the grey, which it turns out is the most stress-free method of all. On Assignment For HuffPost", "https://www.huffingtonpost.co.uk/entry/christmas-work-party-bingo-chaos_uk_61a89bf7e4b044a1cc1f0b4b": "Yes, government officials can’t quite agree on whether we should go or not – and advising us to avoid kissing strangers under the mistletoe if we do. But what is a festive party without any snogging? (And let’s not forget that some government officials are partial to a Chrimbo party themselves. Not to mention an illicit snog). Whether it’s colleagues who’ve been making eyes at each other in the office for weeks leading up to the big event, or just those who happened to be, well, standing next to each other, a cheeky pash between co-workers is all part of the fun. But work and pensions secretary, Thérèse Coffey, has said no more of that please. “I don’t think there should be much snogging under the mistletoe,” she told ITV’s Peston programme.“You don’t need to do things like that. But I think we should all be trying to enjoy the Christmas ahead of us.” Which has got us thinking, what else do we love (or hate) or love to hate about the annual work do shindig? Enjoy our little game of Christmas party bingo – how many of these have you seen or partaken in during Christmases past? As mentioned above, this is just a festive staple. Somewhere very near you, two colleagues are making out.  Who doesn’t love an open bar, on the company’s dime? This is the time to make up for all those extra hours and early starts. Grab that first glass of fizz when you head in the door, then another and another. But, err, maybe don’t overdo it. Your bosses are still around, after all. It’s not our first rodeo, we know we have to get some food down us before the heavy drinking commences, so chasing those tiny salmon crostinis and pigs in blankets will do. It’s all about getting yourself in sight line of the kitchen. If there’s a live band or karaoke machine, then someone is going to get up there and do their rendition of Spice Girls and/or Backstreet Boys. It has to happen, so you might as well relent and give in. Alcohol certainly lowers one’s inhibitions and maybe it’s a good thing when it comes to the dance floor. Some people will be tearing it up while others will be doing big fish, little fish, cardboard box. And we’ll all have a good time. If you didn’t take selfies, did it really happen? And if your office heads have done the good thing and paid for a photo booth, then you best get in line – the silly hats and comically large moustaches aren’t going to wear themselves. Free booze and a closed environment with lots of different people – someone is bound to step on someone else’s foot, both figuratively and literally. And so it’s no surprise if a shouting match or quiet bitching session starts to take place. We love the office party when it allows us to see a looser, more fun side to the people we spend most of the year with.  See point seven. Full on free bubbly with our closest work pals, it’s easy to let something slip, whether you were supposed to or not. This is already a huge perk for many women on an average night out and the work party is no exception. There’s no bonding like sharing a spritz of perfume in the loo or a pair of straighteners if you’re getting ready in the office. Also toilet based. No comment. But it happens.  Oh no, you really have to go? No, just stay for another, and another, and then one more for the road. Before you know it, it’s 3am and the party is over. And lastly, arguably the best part, gossiping about all the shenanigans of the night before, mostly about who hooked up with whom. It’s the only thing that gets us through the almightly hangover. Life Reporter", "https://www.huffingtonpost.co.uk/entry/pea-protein-allergy_uk_618ad212e4b055e47d80f1da": "“I think the first time we realised what it was, he’d had some sausage. Sausages had always been a go to for us,” says the mum from Nottinghamshire. Henry chewed the food and spat it out, but still had an immediate allergic reaction. The otherwise innocent looking pork sausage contained an unexpected ingredient – pea protein. As the trend for veganism and gluten-free diets grows, food manufacturers have been busy replacing wheat and other ingredients in processed food with a highly concentrated form of dried peas. Healthy, yes, but for some people incredibly dangerous. Despite their appearance, peas are not a vegetable but a legume, and closely related to the peanut. Like other people with multiple allergies, particularly nut allergies, Henry reacts to many legumes including peas. Yet, peas and pea protein are not recognised by the government as a common allergen. That means food manufacturers and restaurants are under no obligation to alert customers their products may contain peas. For Williams, feeding her family safely has become even more complicated since the arrival of this new ingredient. “I can’t even buy packed ham now,” she says. “The [cartoon] character ham that kids love? You can’t buy a single one without pea protein now.” It’s a dilemma also faced by Laurna Hunter from Stirlingshire in Scotland, whose now 14-year-old son has lived with multiple allergies, including peas, since infancy. “Peas is the trickiest one,” she tells HuffPost UK. “It’s much harder than milk or nuts, especially in the last couple of years. My biggest issue now is how long it takes me to do the shopping because you have to read every single label, and every single thing on the label.” Hunter made a list of every product she’d stumbled across that contained peas, pea protein or pea fibre. “It’s in cake mix, biscuits, vegan cake, bread, bagels, wraps and rolls. It’s in chips, breaded fish and chicken, sausages, burger, ready meals, ice cream,” she groans. “I don’t know how anybody who would like to be vegan can manage to eat anything that isn’t made from scratch. It’s a huge ingredient in anything plant-based.” The problem is so widespread that author Alexa Baracaia – who is also juggling family life with multiple allergies – dedicated a chapter to less common allergies in her new book, My Family and Food Allergies: The all you need to know guide. “The idea of being allergic to something as benign sounding as a pea sounds farcical to many. How can you be allergic to peas? It can’t be serious! In fact, any allergy can be serious,” she says. “Unfortunately the rise in ‘free from’ and vegan food has been double-edged. Perhaps there’s more choice for those avoiding some of the common allergens, but very often ‘free from’ foods now have pea or lentil flour added into the mix. This is definitely something we are seeing more and more – whether it’s because it adds bulk at an economical price, or ups the protein levels, but these legumes are being put into previously safe products unthinkingly.” According to research presented at the British Society for Allergy and Clinical Immunology conference in October, pea and legume allergies are the most prevalent of ‘less common’ allergens among children. There are also widespread reports of allergies to peas developing in adulthood.  Pea protein, a powder made from dried green or, more often, yellow peas, is thought to be more dangerous to allergen sufferers than the raw ingredient because it contains a higher concentration of the protein strands that cause an allergic reaction. Now sufferers are calling for peas to be listed as an official allergen to make their lives easier. Zak Marks, 23 from London, welcomes the call for change. He has been allergic to nuts since childhood but developed an allergy to peas in his mid-teens. He says people don’t take his allergies seriously because of the lack of legislation around legumes. “Often I tell people I’m allergic to peas and they laugh,” Marks explains. “I think people understand more now, but still nothing really happens until someone dies from a reaction, and then a policy is put in place.” By law, manufacturers must list every allergen on an ingredient list, but ingredients outside the top 14 don’t have to be listed if they make up less than 2% of the product. Sometimes just ‘vegetable fibre’ will be listed, leaving allergy customers no better informed as to whether it poses a risk or not. And while the Food Standards Agency recommends that packets include a ‘may contain’ warning for any product manufactured using the same equipment as other foods containing common allergens such as peanuts, there’s no requirement to do the same for off-list allergens such as pea protein. Laurna Hunter has contacted manufacturers asking for information. Most say they are unable to give it. Her son risks anaphylaxis if he consumes even a trace of legumes, so she has stopped buying foods made by companies that use pea fibre in any of their products. Her family’s diet is increasingly restricted. The lack of awareness is putting lives at risk. Sarah Knight, the founder of The Allergy Team, an online community which supports families living with food allergies, says there is an alarming lack of understanding about pea allergies among the very people responsible for keeping children safe.  She says: “I spoke to a deputy headteacher this year who said, ‘Some of these kids have allergy forms that say they’re allergic to peas; nobody is allergic to peas’. I explained it to her, and she was really mortified by her lack of knowledge. Equally, it was a really clear example of the lack of awareness, and almost that, if you’re not in the top 14, it doesn’t count and people don’t understand.” Many brands are still marketing their products as allergen free, even though they contain legumes such as peas or lentils. Violife, which sells ‘allergen free’ vegan cheese, recently faced backlash on social media from angry parents of children with multiple allergies when it revealed that some of its products would now contain lentil flour, another product based on legumes. A spokesperson for Violife said: “To guarantee a good supply of products to our customers across the globe, we need to ensure a steady supply of product, during the last year we have had to change suppliers and with it the change of an ingredient. We are sorry to have caused distress to any customers and can confirm that we have products in development that do not contain lentil protein which we hope our loyal customers will enjoy.” Other food brands have noticed the big problem that little peas are causing and are being proactive. Heck sausages uses pea protein in its meat and vegan products, and labels it in bold on every ingredients list, even though the company is not required to do so by law. Andrew Keeble, the founder of Heck, said pea protein was cost effective but he knew it was causing issues for some customers and that the company was moving away from use of peas towards rice. “We believe that it should be an allergen, even though the government say it isn’t. We know that it could kill someone. We wanted to get on the front foot,” he tells HuffPost UK. However, the charity Anaphylaxis UK is less comfortable with the push for new allergens to be listed, claiming there is “not enough evidence to support extending the list of top 14 allergies to include other legumes” – a position that will disappoint many multiple allergy sufferers. As for Henry, his mother Nicola Williams hopes that the recent introduction of Natasha’s Law, which requires businesses to provide a full ingredients list for products made and sold on site, will help identify where hidden pea protein could be lurking. “The older he gets, the more aware he is of just checking everything,” she says. “The choice is limited when we carry so many allergies, but I want him to eat out. I want him to be equipped for life in this world. Anything we can do to make it easier to navigate would be amazing.” Freelance journalist", "https://www.huffingtonpost.co.uk/entry/sex-after-becoming-parents_uk_618e81ace4b0c621c5cc69c8": "Many health care professionals recommend avoiding intercourse for about six weeks after giving birth to allow the body time to heal, regardless of delivery method. At your postpartum checkup around this time, the doctor or midwife will do an examination and determine whether you’re cleared to resume sex and exercise.  Even if you had an uncomplicated birth experience, adjusting to all of the physical and emotional changes takes time. Mum Gracie X, an author who asked that we use her pen name, told HuffPost she was surprised by how “beat up” her body was after giving birth.  “It took me six weeks to feel ‘normal’ in terms of my girly parts — and I had a vaginal quick delivery!” she said. “Also, I felt like I was in a hormonal altered state, almost like I had a new and completely different body, swollen breasts, no sex drive and was hyperemotional.” Many who get the green light to have sex at their postpartum appointment aren’t anywhere near ready to do so. In fact, according to a 2019 survey from Motherly, 38% of mums said it took six to 12 months after birth before they were interested in sex again. (On the other hand, 11% of respondents said they were interested in getting busy sooner than the six-week mark — which just goes to show you that the time it takes to feel ready again can vary quite a bit.) Even if you aren’t the birthing partner — or if neither of you gave birth — sex post-baby can be a lot to contend with. You’re probably sleep-deprived, devoting what little energy you have to caring for a tiny human, and perhaps learning how to navigate your partner’s new body and fluctuating hormones.  To find out what sex after a baby is really like, we asked mums to share some of the unexpected things they discovered about the experience. Responses have been lightly edited for length and clarity.  “Sex after baby felt a little uncomfortable. Once my doctor cleared me for sexual activity, I wasn’t afraid to jump back into doing it. But when I did, it felt a little different physically. It wasn’t bad nor painful — it was just different. Over time, I started pinpointing some of the differences. For instance, it was drier down there. It took a little more bells and whistles — aka foreplay — for any kind of natural lubrication to develop.” — Chelsie Washington, host of the “Weird Mom” podcast  “It hurts! As much as I thought I was prepared, I wasn’t. After having a vaginal birth back to back — my children are almost 12 months apart — things just weren’t the same down there. Positions that once were comfortable and enjoyable ended up resulting in pain. I had to learn to be patient and so did my husband. On the bright side, it does get much, much better.” — Tonya Gooch Mann, @thepostpartumeffect on Instagram “Most people know that you can’t do heavy lifting or work out as a C-section mama. But you will also need to be cleared for sex after about six to eight weeks to allow your abdomen to heal. I had very little desire for sex. My body was healing from major surgery and I was also caring for a newborn. Those things combined made sex the absolute last thing on my list to do! I was just exhausted all the time.” — Melissa Campos, @mommothermama on Instagram “My wife had two rough pregnancies and halfway through the first one we lost our daughter. When my wife was four months pregnant with our second baby, we decided to open our home to foster in hopes of adoption. Faster than we expected, we got a call that a baby girl needed a home and we were quickly parents to our now-daughter. Our son was born five months later. It was basically as if we’d had twins, with the babies being within six months of each other. We were in survival mode and sex was the last thing we had effort for. Thank goodness for vibrators, though! We had a standing automatic order on Amazon for batteries, and whenever my wife needed an orgasm, I’d run to the nightstand and break out that hardware.” — Nic R., @lezzimomof2 on Twitter and co-host of the “Redefining the Rainbow” podcast “I felt 100% unsexy for way more than six weeks after giving birth. This was mostly due to the physical toll that breastfeeding took on my body. I literally felt like a cow and the last thing I wanted was someone else touching my body. Luckily, I have a secure and compassionate partner who was supportive of me and never pressured me to go beyond my comfort zone. Through good communication, we found new ways to be intimate.” — Gina McMillen, illustrator at @ginsasdrawingclub “I literally felt like a cow and the last thing I wanted was someone else touching my body.” “When you’re sexually stimulated, your milk will let down. This can be dripping to full-on hydrant stream to your partner’s face. You’ve got to get used to even more fluids than you were before.” — Katie Brunelle, @katiezoeb on Twitter and co-host of the “Redefining the Rainbow” podcast  “It was crazy how much I missed her boobs. While she was breastfeeding, the boobs were off limits and I didn’t realise how much I’d actually miss them.” — Nic R. “I was expecting sex after baby to be really blah. But after having been through something so intense with my husband, lovemaking feels more passionate and intentional. Our baby sleeps in our bed, so we have to get creative on where we have sex. It feels naughty and fun to have sex in different places in our house that we normally wouldn’t! I also noticed that after having a vaginal birth, now certain positions feel better. That’s something I definitely didn’t expect after a baby.” —  Lina Forrestal, motherhood blogger and host of “The New Mamas Podcast”  “After having been through something so intense with my husband, lovemaking feels more passionate and intentional.” “I typically like to be wined and dined to get in the mood. I enjoy romantic play and everything that leads up to sex itself. With a newborn, however, timing was very unpredictable. If I waited around for the perfect moment to get in the mood, then it might never happen at all.” — McMillen “You get to say ‘no’ to sex. We love our partners and we want everyone happy and fulfilled, but if your body is still in recovery (from pushing an entire human out of it) or you’re tired, or your drive is just hard to muster, let sex slide for a little bit. Things will get better and more back to normal. In the meantime, normalise solo sex in your relationship.” — Brunelle  Relationships Reporter, HuffPost", "https://www.huffingtonpost.co.uk/entry/funniest-tweets-from-parents-this-week_uk_61a3fe50e4b07fe2011ab48f": "Scroll down to read the latest batch, and follow @HPUKParents  on Twitter for more! Before I became a parent, I never thought I would break up a fight at a living room guinea pig fashion show, yet here we are. 7 calls Pepto Bismol “Pepmo dismall” and that is how I will refer to it from now Parents are Roy Kent on the inside and Ted Lasso on the outside My toddler’s new thing is to say “Mama” on repeat for 20 minutes straight and I’m not supposed to respond, unless of course I am supposed to respond, in case any of you were thinking of skipping the birth control parenting books should be legally required to display the number of children the author has Mommy blogs be like, How to make your Thanksgiving stress free with 300 tasks you should do in the next 30 minutes. Almost time to put up the Christmas lights or, as my kids call it, “Swear Day.” my 4 year old realizing that I gave her her vitamin gummies this morning and that her mom gave her her vitamin gummies this morning and pacing around worried like she's gonna OD My 4yo: Daddy, I thought Santa gave birth to JesusHusband: No one really knows for sureMe: pic.twitter.com/h90ARisOV5 Since I refuse, 5 was wondering if anyone would like to play “hammers” with her. She has a hammer and you run. So anyway, let me know. people who don't blur their backgrounds on video calls are just bragging that they don't have kids 4: Let's hunt turkeys, Daddy.Me: How do we do that?4: Put up a big sign that says, \"Come here, Turkeys!\"I might be raising Elmer Fudd. “My Fair Lady” but Eliza Doolittle is my 7 year old, and instead of the loud cockney accent I’m trying to coach away a tendency to fart as a greeting to strangers no one:absolutely no one:my 8 year old: i hate lasagna if someone ever brought me one when im old id make my wife eat it 3.5 *Two hours after bedtime: MOOOMMMYYYMe: what's wrong!!!?!? 3.5: what animals don't have teeth? Tell your teenager to clean them out of their room now so you will have enough cups and dishes for Thanksgiving. my kids have been asking for a baby brother or sister and today a little miracle arrived pic.twitter.com/2vog8izlVb If you'd all take a moment to imagine living with a 10 yr old who talks all day in the voice of a flight attendant after a weekend away. My favourite part of parenting right now is that my 4 year old keep making plans to go to his friend’s house after school but doesn’t tell us, his parents, or even his friend, and then loses his mind when it doesn’t actually happen,  what’s yours? When my son was born, I knew that I would love him forever, with a slight break between 12 and 21. Culture & Parenting Reporter, HuffPost", "https://www.huffingtonpost.co.uk/entry/stella-creasy-baby-parliament-mothers_uk_619d1b56e4b025be1ae1ef7a": "The Labour MP was told it was against parliamentary rules to bring a child into a Westminster Hall discussion hours after she carried her three-month-old son with her to a debate on Tuesday. Creasy said this was “news to me” having taken her child – whom she is still breastfeeding – to debates before, and has now called for a review of the parliamentary rules. The Commons has said it is now “in communication” with Creasy, after pointing out to her that “you should not take your seat in the Chamber when accompanied by a child” according to the Westminster rules which were last updated in September. But the MP pointed out that she did not experience any pushback when she used to take her older daughter into the Commons chamber. In a now-deleted Twitter post, Creasy shared the email she received from parliament about taking her child into the Commons and tweeted: “Mothers in the mother of all parliament[s] are not to be seen or heard it seems....#21stCenturyCalling.” Labour MP Stella Creasy has called for reform after being told her three-month old baby was not allowed in the Commons.She tells @KayBurley that \"I think it's just representative of the way in which often if you're a mum you can't win\"#KayBurleyhttps://t.co/iOm40vn1kt pic.twitter.com/rgudYAiPeh Creasy was also quick to point out that there are still no rules on wearing face masks in parliament either, even though the pandemic continues to be a pressing concern. She has since told the BBC that this is “not a system that works for anyone who isn’t a man of a certain age from a certain background”, describing the current scenario as one which “is bad for our democracy”. She continued: “I don’t have maternity cover – I don’t have the employment rights to have maternity cover.” “I’ve had a baby, I haven’t given up my brain or capacity to do things and our politics and our policy making will be better by having more mums at the table,” Creasy added. Speaker of the house Lindsay Hoyle has subsequently asked Commons Procedure Committee to look at rules around bringing babies into the chamber.  MPs are allowed to have paid maternity leave for six months and a proxy vote, but many have said it’s difficult to obtain funding for adequate maternity cover. They still have have to be physically present to represent their constituents’ views during debates as well. “An emerging gender divide in remote working could risk inhibiting women's career progression if employers favour those who are present in the office.” Deputy prime minister Dominic Raab has said he has “a lot of sympathy” for Creasy, as politicians need to make sure “our profession is brought into the modern world [so] parents can juggle the jobs they do with the family time they need”. He added that a baby in the Commons “certainly wouldn’t distract me or get in the way of me doing my job”, but he said it was up to the House’s authorities to decide the “right balance”. Labour MP Alex Davies-Jones tweeted on Tuesday that she had been told by House speaker Lindsay Hoyle that she could breastfeed in the chamber if she needed to. When I was first elected I was still exclusively breastfeeding my child.I met with @CommonsSpeaker to discuss this and was assured that if the need arose I would be able to feed my child in the chamber or Westminster Hall.This rule is now a complete contradiction 🤔 https://t.co/xJWK6BHQoI Former Liberal Democrat leader Jo Swinson is believed to be the first woman to take a baby into the chamber back in 2018. New Zealand’s prime minister Jacinda Ardern was also the first world leader to take her baby to the floor in New York for the UN General Assembly, also in 2018. Creasy’s difficulties in her workplace casts new research from think tank Resolution Foundation in a different light. A survey called Begin Again? – studying how people returned to work after the pandemic – claims 74% of mothers with children aged from 0 up to 3 are now in work. The research said points out that this is an increase compared to previous years. Only 68% of mothers with children that young worked in 2019 and 2017. The findings suggest that the hybrid working model introduced by the pandemic has made it easier for primary care givers to cope with work and parenting. The report also found one in 10 mothers in a relationship said remote working allowed them to find work or increase working hours since February 2020. Yet, the authors of the study noted: “An emerging gender divide in remote working could risk inhibiting women’s career progression if employers favour those who are present in the office. “As we have recommended before, policy makers and employers alike should support working parents, no matter their gender, to balance work and childcare without detriment to their longer-term career prospects.” Senior Trends Reporter, HuffPost UK"}